[{"Belk College of Business": {"Business Info Systems/Operations": {"Anthony Stylianou": {"link": "https://pages.charlotte.edu/connections/people/astylian/", "bio": " Professional Activities  CV Research Portfolio  ", "academic_interests": ["", "", "", "E-business", "e-commerce", "", "", "information systems management", "quality improvement", "", "", ""], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Alan Turovlin": {"link": "https://pages.charlotte.edu/connections/people/aturovli/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}, "Artemis Vouzouni": {"link": "https://pages.charlotte.edu/connections/people/avouzoun/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Belk College of Business", "department": "Business Info Systems/Operations"}}, "Economics ": {}, "Finance ": {}, "Management ": {}, "Marketing ": {}, "Turner School of Accountancy": {"Aloke Ghosh": {"link": "https://pages.charlotte.edu/connections/people/aghosh6/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Belk College of Business", "department": "Turner School of Accountancy"}, "Brian Burnett": {"link": "https://pages.charlotte.edu/connections/people/bburne17/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Belk College of Business", "department": "Turner School of Accountancy"}}}, "College of Arts & Architecture": {"Art & Art History": {"Ann Kluttz": {"link": "https://pages.charlotte.edu/connections/people/aekluttz/", "bio": "      Ann Kluttz is a Senior Lecturer in Photography and the Photographic Facilities Manager for the Department of Art & Art History.   See her faculty profile at coaa.uncc.edu >>  ", "academic_interests": ["", "", "", "art", "photography", "", "", "visual arts", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}, "Angela Rajagopalan": {"link": "https://pages.charlotte.edu/connections/people/aherren/", "bio": "  Dr. Angela Rajagopalan is the Associate Chair and an Associate Professor of Art History in the Department of Art & Art History where she teaches courses on Pre-Columbian and early colonial art and architecture of Mexico and serves as a Faculty Fellow to the Levine Scholars Program. Her research focuses on sixteenth-century painted manuscripts from central Mexico and explores changing artistic practices in the century after the Spanish conquest. She is the author of a book titled, Portraying the Mexica (Aztec) Past: A Study of 16th-Century Mexican Manuscript Painting in Transition,” that will be coming out with the University of Texas Press. Prior to her arrival at UNC Charlotte, she worked in several New York museums, including the Metropolitan Museum of Art, the Brooklyn Museum of Art, the Americas Society Gallery, and the Hispanic Society of America. Dr. Rajagopalan has been the recipient of many awards including several competitive national grants. Among others, she has been awarded a Fulbright Scholar Grant to Mexico from the U.S. Department of State, a National Endowment for the Humanities Summer Institute award, a Coleman Memorial Fund Art History Fellowship from the Metropolitan Museum of Art in New York, and a Mellon Fellowship from the Council on Library and Information Resources.     See her faculty profile at coaa.uncc.edu >>   ", "academic_interests": ["", "", "", "16th-century Mexico", "art", "art history", "colonialism", "culture studies", "", "", "early colonial art", "pre-Columbian art", "Spanish conquest", "visual arts", "visual culture", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}, "Aspen Hochhalter": {"link": "https://pages.charlotte.edu/connections/people/ahochhal/", "bio": "  Aspen Hochhalter is an Associate Professor and the Photography Area Coordinator in the Department of Art & Art History. She was born and raised in Chipita Park, Colorado. She received her Masters of Fine Arts in Photo-Based Media at East Carolina University in Greenville, North Carolina and her BFA in Photography from Creighton University in Omaha, Nebraska.  Her work explores the crossover between digital technologies, historic processes, and the use of experimental materials through appropriation, self-portraiture, and collaborative projects. Recent accomplishments include work published in The Book of Alternative Photographic Processes: 3rd Edition, McColl Center for Art + Innovation Residency, exhibits at Pease Gallery CPCC, Castell Photography Gallery, East Carolina University, Kiernan Gallery, The Light Factory, and many other venues across the country. She serves as the Light Factory’s Board of Directors Vice President and is active in the Society for Photographic Education, serving as a member of the National Board of Directors.   See her faculty profile at coaa.uncc.edu >>           ", "academic_interests": ["", "", "", "alternative photographic process", "appropriation", "art", "art history", "digital technologies", "experimental materials", "", "", "historic art processes", "photography", "portraiture", "self-portraiture", "visual arts", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}, "Anna Kenar": {"link": "https://pages.charlotte.edu/connections/people/akenar/", "bio": "       Anna Kenar is a lecturer in foundations for the Department of Art & Art History.    View her faculty profile at coaa.uncc.edu >> ", "academic_interests": ["", "", "", "art", "art history", "", "", "visual arts", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}, "Andrew Leventis": {"link": "https://pages.charlotte.edu/connections/people/aleventi/", "bio": "       Andrew Leventis is an Assistant Professor of Painting in the Department of Art & Art History. Heis an oil painter who references imagery from film and television in his work. He earned a BFA in Painting from the American Academy of Art in Chicago and an MFA in Fine Art from Goldsmiths College, University of London. Over the past years, his work has been featured in Norway at Kunstgalleriet, in London at Matt Roberts Arts, and in Rome at The Venanzo Crocetti Museum. In the US, his work was recently incorporated into the Mainframeexhibition at the Mint Museum of Art, and at The Brooklyn Waterfront Artists’ Coalition annual juried show. See his faculty profile at coaa.uncc.edu >>   ", "academic_interests": ["", "", "", "art", "art history", "cultural studies", "fine arts", "mass media", "", "", "oil painting", "painting", "popular culture", "visual arts", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}, "Bonnie Noble": {"link": "https://pages.charlotte.edu/connections/people/bjnoble/", "bio": "     Dr. Bonnie Noble is an Associate Professor of Art History in the Department of Art & Art History and has been teaching at the University of North Carolina at Charlotte since 1999. She received her Ph.D. in Art History from Northwestern University, her M.A. in Art History from the University of Pennsylvania and her B.A. in Religious Studies from Northwestern University. Dr. Noble specializes in Northern Renaissance art, with a particular interest in the function of images in devotional practice. Her book Lucas Cranach the Elder: Art and Devotion of the German Reformation, was published in 2009 by the University Press of America. Her work has also appeared in such scholarly journals as Reformation, Sixteenth Century Journal, and Reformation and Renaissance Review, and she is the author of chapters in major Art History publications such as The Primacy of the Image in Northern European Art, 1400-1700 (Leiden: Brill, 2017), Lucas Cranach der Jüngere und die Reformation der Bilder (München: Hirmer, 2015), and The Oxford Encyclopedia of Aesthetics, 2 nd edition (Oxford: Oxford UP, 2014). Her article ‘[A] work in which the angels are wont to rejoice’: Lucas Cranach’s Schneeberg Altarpiece” was honored with the Harold J. Grimm Prize, for the best article published in the previous year in the international field of Reformation Germany. She has received grants from the Kress Foundation, the German Academic Exchange Service, and the National Endowment for the Humanities.        Dr. Noble teaches upper-level classes in Northern Renaissance, Northern Baroque, and Gothic periods, as well as introductory surveys of Art History from the stone age to the twentieth century. Her current book project, provisionally called, Mimesis, Melancholia and Misapprehension,” explores the intersection of representational techniques such as linear perspective with the rise of depictions of Melancholia and anxieties about visual perception. See her faculty profile at coaa.uncc.edu >>   ", "academic_interests": ["", "", "", "art", "art and devotion", "art history", "devotional practice", "Germany", "Gothic periods", "medieval and renaissance periods", "Northern Baroque", "Northern Renaissance", "", "", "Reformation", "religion", "religion and culture", "religious studies", "Renaissance", "renaissance studies", "visual arts", "visual culture", "", "", ""], "college": "College of Arts & Architecture", "department": "Art & Art History"}}, "Dance": {}, "Music": {}, "Performing Arts Services": {}, "School of Architecture": {}, "TheatreBrook Muller": {}}, "College of Computing & Informatics": {"Bioinformatics and Genomics": {}, "Bioinformatics Research Center ": {}, "Computer Science ": {}, "Software & Information Systems": {}}, "College of Education": {"Counseling": {}, "Ctr For STEM Education": {}, "Educational Leadership": {"Alan Mabe": {"link": "https://pages.charlotte.edu/connections/people/amabe3/", "bio": "Department Directory Page ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "Educational Leadership"}, "Ayesha Sadaf": {"link": "https://pages.charlotte.edu/connections/people/asadaf/", "bio": "Department Directory Page ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "Educational Leadership"}}, "Middle Grades Secondary & K-12": {"Adam Myers": {"link": "https://pages.charlotte.edu/connections/people/amyers35/", "bio": "Department Directory Page ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "Middle Grades Secondary & K-12"}, "Brittany Anderson": {"link": "https://pages.charlotte.edu/connections/people/bander64/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "Middle Grades Secondary & K-12"}, "Bettie Butler": {"link": "https://pages.charlotte.edu/connections/people/bbutle19/", "bio": "Assistant Professor Department Directory Page ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "Middle Grades Secondary & K-12"}}, "Reading & Elementary ED": {"Andrew Polly": {"link": "https://pages.charlotte.edu/connections/people/abpolly/", "bio": "Associate Professor & Coordinator of Ph.D. Strand in Elementary Education Faculty Website Curriculum Vitae NCATE Vita Co-Director, UNC Charlotte Professional Development School Network Program Coordinator, Graduate Certificate/License in Elem. School Mathematics Research Interests:  My research and teaching focus on supporting pre-service and in-service teachers design and implementation of learner-centered tasks. My work explores how teacher education and professional development programs can most effectively support teachers’ efforts to integrate technology and learner-centered tasks into their classroom.  Projects: Current Projects: Assessment Practices to Support Mathematics Learning and Understanding for Students (APLUS) A state-wide Mathematics Science Partnership project funded by the North Carolina Department of Public Instruction. The grant involves 6 school districts and provides professional development about mathematics formative assessment for teachers in Grades Kindergarten through Grade 2. Exploring Mathematical Tasks This project focuses on exploring how teachers design, implement, and modify mathematical tasks in their classrooms. This project focuses on the interplay between mathematical tasks and student understanding. Technology Integration in Mathematics This project focuses on exploring how teachers integrate technology in their mathematics teaching. The focus is on the interplay between technologies, mathematical tasks, teachers’ actions, and student understanding. Past Projects: Content Development for Investigations (CoDe-I) A Mathematics Science Partnership project funded by the North Carolina Department of Public Instruction. Over 400 teachers participated in 70 hours of professional development focused on theInvestigationsmathematics curriculum as well as the implementation of the Common Core Mathematics Standards Department Directory Page ", "academic_interests": ["", "", "", "in-service teachers design", "learner-centered tasks", "", "", "pre-service teachers design", "technology integration", "", "", ""], "college": "College of Education", "department": "Reading & Elementary ED"}, "Anne Cash": {"link": "https://pages.charlotte.edu/connections/people/acash7/", "bio": "Assistant Professor Curriculum Vitae Research Interests: My research and teaching focus on the measurement and improvement of teachers’ practice and knowledge causally related to students’ academic, behavioral, and social outcomes. Evidence supports operationalizing effective practice and knowledge in terms of observable teacher-student interactions. We can improve teacher-student interactions by providing teachers with explicit evaluations, feedback, and training. However, teacher improvement efforts must be supported by reliable, valid measurement and rigorous research designs. In my research program, I seek to 1) measure teachers’ practice of effective teacher-student interactions through observations that are reliable and valid, 2) measure teachers’ knowledge of effective interactions related to observed teacher practice and to student outcomes, and 3) identify processes that improve teachers’ practice and knowledge of effective teacher-student interactions in school contexts. Education: Ph.D., University of Virginia, Educational Psychology – Applied Developmental Science B.S., Furman University, Psychology Projects: Measuring teacher effectiveness: Video Assessment of Interactions and Learning: Development of a scalable, web-based assessment of elementary grade teachers’ skills in identifying effective classroom interaction. Observing the Setting-level Impact of a High School Behavioral Change Intervention: A 60-School Randomized Trial (PI: Catherine Bradshaw), Co-Investigator: Collected and now analyzing observational data related to student behavior, classroom context, and school climate in conjunction with a 60 high school randomized trial of PBIS and related evidence-based prevention programs in high schools. This project represents one component of the Maryland Safe and Supportive Schools (MDS3) Project. Past Projects National Center for Research on Early Childhood Education (NCRECE; PI: Robert Pianta): A large randomized controlled trial of two types of professional development delivered to over 490 early childhood education teachers. Department Directory Page ", "academic_interests": ["", "", "", "academic outcomes", "behavioral outcomes", "observational data reliability", "observational data validity", "social outcomes", "student outcomes", "", "", "teacher evaluation", "teacher improvement", "teacher knowledge", "teacher practice", "teacher-student interactions", "", "", ""], "college": "College of Education", "department": "Reading & Elementary ED"}, "Amy Good": {"link": "https://pages.charlotte.edu/connections/people/agood5/", "bio": "Associate Professor & Program Director, Elementary Education Masters of Arts in Teaching (MAT), Masters of Education (MED) Programs Research Interests:  The social studies classroom environment Technology integration Videoconference use in methods courses.  Department Directory Page ", "academic_interests": ["", "", "", "social studies classroom", "social studies classroom environment", "technology integration", "", "", "videoconference", "videoconference use in methods courses", "", "", ""], "college": "College of Education", "department": "Reading & Elementary ED"}, "Adriana Medina": {"link": "https://pages.charlotte.edu/connections/people/amedina1/", "bio": "Associate Professor and Coordinator for Graduate Reading Program Faculty Website Research Interests:  Adolescent literacy Teacher education and educational program evaluation  Department Directory Page ", "academic_interests": ["", "", "", "adolescent literacy", "educational program evaluation", "", "", "literacy", "teacher education", "", "", ""], "college": "College of Education", "department": "Reading & Elementary ED"}}, "School & Community Partnerships": {"Ashley Bayer": {"link": "https://pages.charlotte.edu/connections/people/abayer2/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "School & Community Partnerships"}, "Ann Jolly": {"link": "https://pages.charlotte.edu/connections/people/ajolly1/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "School & Community Partnerships"}, "Amy Rogen": {"link": "https://pages.charlotte.edu/connections/people/arogen/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Education", "department": "School & Community Partnerships"}}, "Special Ed & Child Dev": {}}, "College of Health & Human Services": {"Kinesiology": {}, "Public Health Sciences": {}, "School of Nursing": {}, "School of Social Work": {}}, "College of Liberal Arts & Sciences": {"Africana Studies": {"Akinwumi Ogundiran": {"link": "https://pages.charlotte.edu/connections/people/akinwumi-ogundiran/", "bio": " Education:  Ph.D., Boston University, 2000 M.Sc., University of Ibadan, 1991 B.A. (First Class Honors), Obafemi Awolowo University, Ile-Ife, 1988  Appointment: Dr. Akin Ogundiran is Chancellor’s Professor, and Professor of Africana Studies, Anthropology & History at the University of North Carolina, Charlotte where he also served as chair of the Africana Studies Department from 2008 to 2018. He previously taught in the Department of History at Florida International University, Miami and served as director of the institution’s African-New World Studies, 2006-2008. His teaching career began in Nigeria where he taught at the University of Benin, among others. Research and Scholarship: Dr. Ogundiran is a transdisciplinary scholar whose research interests focus broadly on the emergent communities, social complexity, and cultural history in the Yoruba world over the past one thousand years, using archaeological, historical, ethnographic, and material science methods. His earlier research efforts sought to understand the impacts of global/regional social, political, and economic processes on community formations; and how social actors created knowledge, communities, and identities with objects and the landscape, 1000-1800 AD. Ogundiran is currently leading a research project on the political economy and settlement ecology of the Oyo Empire, focusing on the landscape history of the empire’s metropolitan area (Oyo-Ile) and one of its colonies (Ede-Ile). He has also facilitated collaborative projects on the archaeology of Atlantic Africa and the African Diaspora. In addition, he has written on historiography, Black Intellectual Thoughts, social sustainability, and cultural heritage issues. Dr. Ogundiran has received support for his research from the National Geographic Society, Archaeological Institute of America, National Humanities Center, Carnegie Foundation, Dumbarton Oaks, Social Science Research Council, Wenner-Gren Foundation for Anthropological Research, National Endowment for the Humanities, Boston Humanities Foundation, American Philosophical Society, and the National Science Foundation-supported programs, among others. In spring 2018, he was a Yip Fellow in Magdalene College, University of Cambridge. Ogundiran has convened major conferences and symposia including the Haitian Constitutional Reform (2007), African Culture and Development (2007), Orisa Music and Dance: Discourses of Modernity and Transnationalism (2008), Materialities and Meanings of Rituals in Atlantic Africa and the African Diaspora (Society of Historical Archaeology Annual Conference, January 2009, Toronto), Presidency of Barack Obama (2010), the New African Diaspora in the US (2011), and Moral Economies (2014). He also curated two exhibitions – one on stamps, and the other on hisarchaeological research in the Osun-Osogbo Sacred Grove, Nigeria. He has been profiled and his publications anthologized in publications, including Encyclopedia of Global Archaeology. He currently serves as Editor-in-Chief of African Archaeological Review, and he is on the editorial board of several journals and book series. Publication: Dr. Ogundiran has authored, edited, and co-edited several publications, including Archaeology and History in Ilare District, 1200-1900(Cambridge Monograph in African Archaeology 55, 2002);Precolonial Nigeria(Africa World Press, 2005);Archaeology of Atlantic Africa and the African Diaspora (Indiana University Press, 2007); Power and Landscape in AtlanticWest Africa(Cambridge University Press, 2012); and Materialities of Ritual in the Black Atlantic(Indiana University Press, 2014), which won a Choice Outstanding Academic Title for 2015. His latest book is The Yoruba: A New History (2020). Recognition: Dr. Ogundiran has been recognized for his research, service, and teaching. He is the recipient of the 2006 University of Texas Africanist Award for Research Excellence. In 2007, he was awarded a Certificate of Special United States Congressional Recognition for Excellence in Service. He was presented with the TOFAC Research, Leadership, and Service Award at the University of North Carolina-Wilmington in 2013. In 2018, Nigeria’s Centre for Black Culture and International Understanding, a Category II affiliate of UNESCO, presented him with its Award of Excellence. He is a member of the Mu Chapter of Phi Beta Delta (Honor Society for International Scholars) and The Honor Society of Phi Kappa Phi, the nation’s oldest and most selective all-discipline collegiate honor society. He is recipient of UNC Charlotte’s highest honor for research excellence, the First Citizen’s Bank Scholars Medal (2021). Recent Courses Taught:  Great Archaeological Discoveries in Africa African Civilizations African Diaspora and Transnational Theory Capitalism, Africa, and the African Diaspora African Diaspora Cultures Senior Seminar: Africana Modernities Yoruba Language and Culture  Selected Keynotes and Public Lectures:  City of Newton (NC) 2009 Unity Day Guest Speaker Ubuntu: An African Philosophical Reflection on One Community, One Humanity” From Politics of Resistance to Pedagogy of Renewal: The Legacies of the African Diasporas in the Making of American Democracies.” Keynote Address, CAPES/FIPSE Brazil-US Symposium on Legacies of African Diaspora in Brazil and the United States. Universidade Federal de Minas Gerais, Belo Horizonte, Brazil. May 26th to 28th, 2011. Crises of Culture and Consciousness in the Postcolony: What is the Future for Nigeria?,” Keynote Address, CULTURE AND SOCIETY IN POST-COLONIAL NIGERIA: CONFERENCE IN HONOR OF ULLI BEIER. November 28 – 30, 2011, University of Ibadan, Ibadan. Collapsing Boundaries: A Continental Vision for African Archaeology.” Keynote Address, Joint 14th Congress of the Pan-African Archaeological Association of Prehistory and Related Studies and 22nd Biennial Meeting of the Society of Africanist Archaeologists. University of the Witwatersrand, Johannesburg, South Africa. July 14-18, 2014. The Archaeology of Aláàfin’s Legacy and Heritage.” Keynote address delivered at the International Conference on the Alaafin of Oyo Institution, organized by The Centre for Black Culture and International Understanding, Osogbo, and held at Ajayi Crowther University, Oyo. October 8-11, 2018. Archaeology of Atlantic Modernity: Global Experience, Local Meaning,” The 28th Annual Distinguished Lecture in African Archaeology, University of Florida, Gainesville. January 17, 2020.  Other Resources:  Wikipedia Page Twitter Facebook Page  ", "academic_interests": ["", "", "", "African modernities", "archaelogy", "cultural history", "", "", "diaspora", "material culture", "transatlantic studies", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Africana Studies"}}, "Anthropology": {"Andrea Freidus": {"link": "https://pages.charlotte.edu/connections/people/afreidus/", "bio": "       ASSISTANT PROFESSOR      PROFILE: Dr. Andrea Freidus is an assistant professor of anthropology at UNC Charlotte. She specializes in applied and medical anthropology. She also has an MPH in global public health. She has worked in Latin America, Africa, and South Florida. Her research has looked at the rise of grassroots transnational organizations targeting aid to orphans in Malawi, southern Africa. She explores the emerging global connections among volunteers, donors, development workers, program organizers and the directors associated with these organizations and the children they serve. She has also worked on projects that included an examination of risky sexual behavior between female long term tourists and local men in Monteverde, Costa Rica, farmworker experiences with eye injury and access to medical care in Immokalee, Florida, and community experiences with evacuation and relocation in and around Mount Tungurahua in Ecuador. Her most current research examines the rise of volunteer tourism with orphans and the proliferation of International Medical Experiences (whereby undergraduates, medical students, and residents volunteer in health programs in the resource poor contexts). Freidus Curriculum Vitae  EDUCATION:  PhD, Michigan State University – Department of Anthropology, 2011 Dual Degree – MA, MPH University of South Florida –Department of Anthropology and College of Public Health 2005 BA, Vanderbilt University – Nashville, TN 1999  TEACHING:  Culture, Health, and Illness (Introduction to Medical Anthropology) Health and Human Rights Development in Southern Africa  RESEARCH INTERESTS/AREAS OF EXPERTISE:  Medical Anthropology and Applied Anthropology Health and Human Rights Development, Globalization, and Health Comparative Child Welfare Tourism, Volunteer Tourism, International Medical Experiences  AWARDS/HONORS/GRANTS:  Michigan State University Graduate School Dissertation Completion Fellowship, August 2010 – December 2010 Michigan State University Residential College of the Arts and Humanities Fellowship, August 2009 – May 2010 Fulbright Hays Doctoral Dissertation Research Abroad, January 2008 U.S. Department of Education Title IV Foreign Language and Area Studies (FLAS) Fellowships (2005-2008)  SELECT PUBLICATIONS:  Freidus, Andrea 2016 Unanticipated Outcomes of Voluntourism among Malawi’s Orphans. Journal of Sustainable Tourism. DOI:10.1080/09669582.2016.1263308. Freidus, Andrea 2016 Blaming Their Mothers: Policing Childhood through The Learning Channel’s Toddlers in Tiaras. In Cultural Anthropology: Contemporary, Public and Critical Readings, Keri Vacant Brondo, ed. Pgs.453-461. Oxford University Press: New York. Freidus, Andrea 2013 Malawi’s Orphans: Children’s Rights in Relation to Humanitarianism, Compassion, and Childcare.” In Worlds of Human Rights: Ambiguities of Rights Claiming in Africa, A. Hellum, B. Derman, and K. Sandvik, eds. Pgs. 303-332. Brill Publishing: Boston, MA. Freidus, Andrea and Anne Ferguson 2013 Malawi Orphans: The Role of Transnational Humanitarian Organizations.” In Vulnerable Children: Global Challenges in Education, Health, Well-being, and Child Rights. D. Johnson, D. Agbenyiga, and B, Hitchcock, eds. Pgs. 203-213. Springer Press Freidus, Andrea 2010 Raising Malawi’s Children: Unanticipated Outcomes Associated with Institutionalized Care. Children and Society 24(4): 293-303. Freidus, Andrea 2010 Saving” Malawi: FAITHFUL responses to orphans and vulnerable children. North American Practicing Anthropology Bulletin 33(1): 50-67.       ", "academic_interests": ["", "", "", "applied anthropology", "child welfare", "globalization", "health", "", "", "human rights", "international medical experiences", "medical anthropology", "volunteer tourism", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Anthropology"}, "J. Alan May": {"link": "https://pages.charlotte.edu/connections/people/alan-may/", "bio": "Received:Ph.D. From:University of Missouri Specialty:Archaeology, North America, North Carolina. ", "academic_interests": ["", "", "", "archaeology", "North America", "", "", "North Carolina", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Anthropology"}}, "Biological Sciences": {"Aaron Kampe": {"link": "https://pages.charlotte.edu/connections/people/aaron-kampe/", "bio": "Hey there! Welcome to my faculty webpage. Here you’ll get to know me as a professor by perusing the site to find information on the research I’ve done as well as information on current projects and classes I teach. In addition you’ll find helpful links to relevant information and videos. INTERACTIVE LEARNING and SCIENCE EDUCATION: My passion is teaching science through interactive learning. I teach biology to both majors and non-majors and aim to integrate both creativity and practicality. I write songs and poems about class material to entice and enhance interest. I also integrate Practical Biology” and Wildwood Wisdom” sections to inform students of the application of concepts they are learning in class. I strive to make learning as interactive as possible by creating a multitude of in-class activities and facilitating continuing group work. I use as many tools as possible including eLearning suites such as Canvas and SymBio as well as in class transmission software such as Poll Everywhere to further improve interaction among students. Field Ecology – in the field and in the lab: I teach field ecology and coordinate the ecology labs. Field ecology’s main goal is to provide students with an understanding of their local ecosystem using modern sampling methods. Wildlife biologists, zoologists, conservation biologists, ecologists, botanists, dendrologists, marine biologists, agronomists, entomologists, ornithologists, biological science technicians, park rangers,veterinarians and even curators of natural science museums often develop their first practical field skill set in field ecology and ecology lab. Due to this it is often an extremely exciting and challenging experience. I do my best to pique student interest and provide them with the skill set necessary to begin one of many career options in the world of natural sciences. Principles and General Biology: Principles of Biology is an integral part of many majors’ undergraduate careers including nursing, psychology, and education majors. In addition, it is often the class where many students decide they want to study biology for the long term. As a non-majors biology class it is extremely challenging and creativity in teaching methods is a necessity to maintain interest in a course that covers all aspects biological life and how it functions. Click here for a sample song I sing to my classes about mitosis. I also teach the introductory course sequence (2120 and 2130) of biology for majors. As these courses are often grueling in detail I make each lecture thematic to best capture students attention. We don’t study the respiratory system, we learn how Freedivers manipulate it. We don’t study animal development, we learn why Heptapods are the perfect aliens. I also teach students a number of Mnemonic systems in these classes that they can use to maximize their memorization abilities throughout their collegiate career. PROJECTS Arbor 49er: Arbor 49er was created to optimize student interaction with their local ecosystem while simultaneously enhancing the skill set of ecology students. Many universities have representative tree species labeled throughout campus and are even nationally recognized arboretums. In an effort to put UNCC’s trees on the map” so to speak I created the initiative termed Arbor 49er. 49 representative tree species on the campus of the University of North Carolina at Charlotte were selected by myself and students in my Fall 2012 Ecology Lab. Pictures of the species were taken and exported to the appropriate cartographic locations in Google Earth. Demographic data were gathered on the trees and descriptions were written for each tree species. Thus, an interactive map was created. For more information on the evolution and collaboration of this project click the Arbor 49er tab above. Downloadable Google Earth files can be assessed via the Arbor 49er tab in either fully descriptive or mystery tree hunt form as well. A hard copy brochure is available and permanent brass signs are now in place! Piedmont Diving Rescue Association: As the Environmental Quality Research Officer for the North Carolina Piedmont Diving Association (PDRA), I monitor water quality and overall ecological health of a number of local quarries. These quarries are used for both recreational and rescue dive training. They are also a unique learning environment as they provide an opportunity for students to conduct studies outside of the campus ecological reserve.Together with the PDRA my students and I aim to maintain the health of these quarries semester after semester. RESEARCH Barred Owls: Who cooks for you! Who cooks for you too!” goes the often phrased Barred Owl call. The first research I conducted was alongside Dr. Richard Bierregaard and involved studying the local Barred Owl (Strix varia) population in its suburban habitat. The focus of this study was South Charlotte. I built traps, radio tagged, and then telemetry tracked the owls at night. Pretty scary, huh? These locations were then registered in Google Earth for later use in demographic study. We built owl boxes to encourage nesting and installed nest cams to monitor prey delivery as well. You wouldn’t believe what Barred Owls eat! For more information on this awesome study click the Barred Owl tab above. American Bullfrogs: To us, the American Bullfrog (Rana catesbeiana) is quite harmless. However, believe it or not, among amphibians they’re tough guys and dangerous predators. They’ve been known to eat small birds and even each other! For my graduate studies, with Dr. Sue Peters, I investigated the role of testosterone on the musculature involved in grappling and amplexus (bullfrogs mating embrace). In a world with increasing pollution, natural waterways are easily susceptible to destruction. Amphibians are classic indicators of ecological health and relevant research conducted in relation to their evolutionary adaptations is invaluable for their conservation. To read more about bullfrogs and this study click the American Bullfrogs tab above.  ", "academic_interests": ["", "", "", "arboretums", "bullfrogs", "ecology", "", "", "owls", "quarries", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Biological Sciences"}, "Adam Reitzel": {"link": "https://pages.charlotte.edu/connections/people/adam-reitzel/", "bio": " Adam M. Reitzel Associate Professor of Biology PhD, Boston University, 2008 My laboratory is interested in answering integrative questions concerning the evolution and ecology of coastal invertebrates by using an interdisciplinary approach that combines comparative genomics, molecular biology, population genetics, evolutionary ecology, and field studies. We utilize species in the phylum Cnidaria (sea anemones, corals, and jellyfishes) as models because of their ecological importance and phylogenetic position. Our focal species is the starlet sea anemone, Nematostella vectensis, which has emerged as a model cnidarian species due to availability of a sequenced genome, ease of culture in the laboratory, and distribution in high marsh estuarine habitats. Reitzel lab website: https://sites.google.com/site/thereitzellab/ ", "academic_interests": ["", "", "", "coastal invertebrates", "comparative genomics", "ecology", "evolution", "", "", "evolutionary ecology", "molecular biology", "population genetics", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Biological Sciences"}, "Andrew Truman": {"link": "https://pages.charlotte.edu/connections/people/andrew-truman/", "bio": "The Truman Lab has moved sites! Please see:  Trumanlab.org  For undergraduate, graduate or postdoctoral research opportunities, please see here:  Research Opportunities     Hsp70 and Hsp90 are well-conserved molecular chaperones that bind and fold a a large proportion of proteins in the cell. Many cancer proteins are inherently unstable and need chaperones to maintain activity. We are interested in the basic questionof the role of molecular chaperones in breast and prostate cancer. We are focused in novel ways to manipulate Hsp70 function by either inhibiting specific helper” co-chaperone proteins such as Hsp40 or by modulating phosphorylation on Hsp70. By fine-tuning” Hsp70 function, we hope to identify novel ways to destabilize cancer proteins.  The Truman lab incorporates protein biochemistry, molecular biology, proteomics, systems biology,bacterial andyeast genetics and cell culture technologies. Keywords:protein-protein interactions,protein folding,CRISPR-CAS9, breast cancer,signal transduction,phosphorylation, Hsp70, Hsp90, cell cycle, DNA damage response, yeast genetics.    Tweets by TrumanLabhttps://platform.twitter.com/widgets.js    Hsp70 Hsp70 Hsp70 Hsp70               ", "academic_interests": ["", "", "", "breast cancer", "cancer biology", "cell biology", "CRISPR", "mass spectrometry", "molecular biology", "molecular chaperones", "phosphorylation", "", "", "prostate cancer", "protein function", "protein-protein interactions", "proteins", "proteomics", "signal transduction mechanisms", "signaling pathways", "yeast", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Biological Sciences"}, "Bao-Hua Song": {"link": "https://pages.charlotte.edu/connections/people/bao-hua-song/", "bio": " Bao-Hua Song Associate Professor Email: bsong5@uncc.edu Tel: 704-687-8670  Education and Training  Postdoctoral Associate, Duke University, Durham, NC Max Planck Postdoctoral Fellow, Max Planck Institute of Chemical Ecology, Jena, Germany Ph.D., Beijing Institute of Botany, Chinese Academy of Sciences, Beijing, China  Research Interest Ecological and Agriculture Genomics:Research in my lab focuses on understanding molecular mechanisms and evolution of complex trait variation related to agriculture and human health integrating genetics, biochemistry, evolution, and omics approaches. I am recruiting prospective graduate students. If you are interested in joining this active international team, please contact me at bsong5(at)uncc(doc)edu. Funding  NIH-National Institutes of Health NCBC-North Carolina Biotechnology Center UNCC-University of North Carolina at Charlotte CRI-Charlotte Research Institute Monsanto Company NCSPA-North Carolina Producers Association  Selected Publications  Zhang H, Yasmin F#,Song B-H*.Neglected treasure in the wild – Legume wild relatives in food security and human health.Current Opinion in Plant Biology. 2019. 49: 17-26 https://doi.org/10.1016/j.pbi.2019.04.004.(#Graduate Student) Kofsky J#, Zhang H,Song B-H*.The untapped genetic reservoir: The past, current, and future applications of the wild soybean (Glycinesoja).Frontiers in Plant Science. 2018. 9, 949.https://doi.org/10.3389/fpls.2018.00949(#Graduate Student) Zhang H, Kjemtrup-Lovelace S, Li C, Chen LP#, and Song B-H*. Comparative RNA-Seq Analysis Uncovers a Complex Regulatory Network for Soybean Cyst Nematode Resistance in Wild Soybean. Scientific reports. Aug 29;7(1):9699. doi: 10.1038/s41598-017-09945-0. PubMed PMID: 28852059; PubMed Central PMCID: PMC5575055. . (# REU Student) Luo Y&, Reid R&, Freese D#, Li C, Watkins J, Shi H, Zhang H, Loraine A*, and Song B-H*.Salttolerance response revealed by RNA-Seq in a diploid halophytic wild relative of sweet potato.2017,Scientific Reports. 2017 Aug 29;7(1):9624. doi: 10.1038/s41598-017-09241-x. PubMed PMID: 28852001; PubMed Central PMCID: PMC5575116. (&Co-first Author)(#Graduate Student) Leamy LJ, Zhang H, Li C, Chen CY, Song B-H*. A genome-wide association study of seed composition traits in wild soybean (Glycine soja). BMC Genomics. 2017 Jan 5;18(1):18. doi: 10.1186/s12864-016-3397-4. PubMed PMID: 28056769; PubMed Central PMCID: PMC5217241. Zhang H, Mittal N#, Leamy JL, Barazani O, and Song B-H*. Back into the Wild – Apply untapped genetic diversity of wild relatives for crop improvement. 2016 Evolutionary Applications. 1752-4571. DOI: 10.1111/eva.12434(# Graduate student). Zhang H, Li C, Davis EL, Wang J, Griffin JD. kofsky J#, and Song B-H*. Genome-Wide Association Analysis of Resistance to Soybean Cyst Nematode (Heterodera glycines) HG Type 2.5.7 in Wild Soybean (Glycine soja).2016Frontiers in Plant Science. 7: 1214.doi:10.3389/fpls.2016.01214(#Graduate Student) Leamy JL, Lee C-R, Song Q, Mujacic I#, Luo Y, Chen CY, Li C, Kjemtrup S, and Song B-H*. Environmental versus geographical effects on genomic variation in a wild soybean (Glycine soja) across its native range in Northeast Asia. 2016. Ecology and Evolution. DOI: 10.1002/ece3.2351. (# undergraduate student). Luo Y*, Hu J-Y, Li L, Luo Y-L, Wang P-F andSong B-H*Genome-wide analysis of gene expression reveals gene regulatory networks that regulate chasmogamous and cleistogamous flowering in Pseudostellaria heterophylla (Caryophyllaceae). 2016. BMC Genomics17: 382.DOI:10.1186/s12864-016-2732-0 Prasad, KVS& , Song B-H&, Olson-Manning C&, Anderson JT, LeeC-R, Schranz ME, Windsor AJ, Clauss MJ, Manzaneda AJ, Naqvi I, Reichelt M, Gershenzon J, Rupasinghe SG, Schuler V, Mitchell-Olds T,A novel gain-of-function polymorphism controlling complex traits and fitness in nature.Science(&Co-first Author). 2012, 337-1081-1084 Gossmann TI,Song B-H, Windsor AJ, Mitchell-Olds T and Eyre-Walker, Genome wide analyses reveal little evidence for adaptive evolution in plants.Molecular Biology and Evolution2010, 27: 1822-1832 Song B-H, Windsor A, Ramos-Onsins S, Schmid KJ, Schranz ME, Heidel A, Mitchell-Olds T, Multilocus nucleotide diversity, population structure and linkage disequilibrium of a wild Arabidopsis relative −Boechera stricta.Genetics2009, 181: 1021–1033 Song B-Hand Mitchell-Olds T, High genetic diversity and population differentiation inBoechera fecunda, a rare relative of Arabidopsis.Molecular Ecology2007, 16: 4079-4088 Schranz ME,Song B-H, Winsor AJ and Mitchell-Olds T, Comparative genomics in the Brassicaceae: the need for family- a family-wide perspective.Current Opinion in Plant Biology2007, 10: 168-175 Song B-H, Clauss M, Pepper A, Mitchell-Olds T, Spatial patterns of microsatellite variation inBoechera stricta, a close relative of Arabidopsis.Molecular Ecology2006, 15:357–369 Song B-H, Wang X-Q, Wang X-R, Ding K-Y, Hong D-Y, Cytoplasmic composition ofPinus densataand population establishment of the diploid hybrid pine.Molecular Ecology2003, 12: 2995-3001 Song B-H, Wang X-Q, Wang X-R, Sun L-J, Hong D-Y, Peng P-H, Maternal Lineage ofPinus densata, a diploid hybrid.Molecular Ecology2002, 11: 1057-1063  ", "academic_interests": ["", "", "", "ecological genetics", "ecological genomics", "ecology", "", "", "evolution", "plant evolution", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Biological Sciences"}}, "Chemistry": {"Agampodi De Silva Indrasekara": {"link": "https://pages.charlotte.edu/connections/people/adesilva/", "bio": "       Chemistry     ASSISTANT PROFESSOR        Research Website      Google Scholar Department Profile Page Field of Interest: Nanotechnology/Analytical Chemistry/Materials Chemistry Research Focus: We are interested in designing new optically active nanomaterials and using them to develop optical spectroscopy-based analytical tools. At the nanometer scale, noble metals such as gold, silver, platinum, and copper exhibit unique, synthetically tunable optical properties. One such property of noble metal nanomaterials is the large optical field enhancement leading to strong absorption and scattering of light. We use the synergy between the enhanced optical properties of noble metal nanomaterials and the intrinsic electronic, optical, and vibrational responses of molecules to develop new functional nanomaterials and analytical methodologies. Techniques combining our light-based analytical approaches with the new functional nanomaterials will allow us (i) to elucidate dynamic interactions between various interfaces of nanoscale materials and biological-chemical systems, (ii) to develop a mechanistic understanding of molecular-level processes significant in medicine and energy applications, and also (iii) to develop field-transferable diagnostics and translational nanotheranostics. The outcomes of our work impact a wide range of fields, including nanomedicine, medical diagnostics, food and agriculture and also energy industry.    ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Chemistry"}, "Bernadette Donovan-Merkert": {"link": "https://pages.charlotte.edu/connections/people/bernadette-donovan-merkert/", "bio": "Education B.S., Duke University (1983, Chemistry) Ph.D., The University of Vermont (1988, Inorganic and Analytical Chemistry) Postdoctoral Fellow,Dartmouth College (1988-90, Organometallic Chemistry) Postdoctoral Fellow, The University of Texas at Austin (1990-92, Electrochemistry) Positions Held at UNC Charlotte Professor and Chair, Department of Chemistry (since 2004) Director (since 2011), Interim Director (2007-2011), Nanoscale Science Ph.D. Program Professor (since 2003), Associate Professor (1998-2003), Assistant Professor (1992-98) Distinctions and Honors (selected)                            Chair-Elect (2017), Division of Inorganic Chemistry, American Chemical Society Chair (2014), Chair-Elect (2013), Gordon Research Conference on Organometallic Chemistry Fellow, American Chemical Society (2011) Bonnie Cone Fellowship, UNC Charlotte (2010) UNC Charlotte Nominee, U.S. Professor of the Year Award (2004) Camille and Henry Dreyfus Scholar-Fellow Award (2003) Harshini V. de Silva Graduate Mentor Award, UNC Charlotte (2003) Finalist, Bank of America Award for Teaching Excellence, UNC Charlotte (2002) US Young Observer, IUPAC Meeting, Brisbane, Australia (2001) Henry Dreyfus Teacher-Scholar Award (1998) Chair (1996), Chair-Elect (1995), Carolina-Piedmont Local Section, American Chemical Society Research Overview Myresearch programfocuses on electron-transfer reactions of organometallic complexes. By oxidizing or reducing these compounds we often generate species that undergo interesting reactions or form complexes in unusual oxidation states. In many cases redox activation of organometallic complexes accelerates known reactions of these compounds, activates otherwise inert complexes, or allows reactions to occur under milder conditions. We study the reactions and their products using electrochemical methods and other instrumental techniques including, but not limited to, NMR, IR, ESR and GC/MS. A major area of current investigation involves the use of electrochemistry to promote asymmetric transformations. Courses Taught: Freshman Seminar (ARSC 1000) Science, Technology and Society (LBST 2219) Quantitative Analysis (CHEM 3111) Survey of Instrumental Methods of Analysis (CHEM 3113) Instrumental Methods (CHEM 4111) Advanced Analytical Chemistry – Practical NMR Spectroscopy (CHEM 6115) Advanced Analytical Chemistry – Electrochemistry (CHEM 6115) Organometallic Chemistry (CHEM 6126) Perspectives at the Nanoscale (NANO 8001) Introduction to Instrumentation and Processing at the Nanoscale (NANO 8101)  ", "academic_interests": ["", "", "", "analytical chemistry", "electrochemical methods", "electron transfer reactions", "instrumental methods of analysis", "", "", "nmr spectroscopy", "organometallic complexes", "oxidation states", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Chemistry"}}, "Communication Studies": {"Ashli Stokes": {"link": "https://pages.charlotte.edu/connections/people/ashli-stokes/", "bio": "   Education  B.A., Virginia Tech University, 1996 M.A., Wake Forest University, 1998 Ph.D., University of Georgia, 2004  Areas of Interest  Rhetoric and Public Communication Southern Food and Culture Food Studies Identity and Culture Organizational Rhetoric, Corporate Communication, and Social Responsibility  Bio Dr.Ashli Quesinberry Stokes(PhD, University of Georgia)is a Professor of Communication Studies and the former Director of the Center for the Study of the New South at the University of North Carolina at Charlotte.A 20-21 Fulbright Scholar, her researchabout communicating identity in the Southern food movement has been described as a call to action.” She recently editedCity Places, Country Spaces: Rhetorical Explorations of the Urban/Rural Divide(Peter Lang), and co-authoredConsuming Identity: The Role of Food in Redefining the Southwith Wendy Atkins-Sayre.Her research exploring intersections between identity, activism, and regions has beenfeatured in leading academic outlets such as theSouthern Communication Journal, Public Relations Inquiry, Journal of Public Interest Communications, and Journal of Public Relations Researchand includes four books, while she also contributes to local and national media, such as theSmithsonian/Zocalo Public Square, Academic Minute, andNPR. Recipient of the National Communication Association Public Relations Division PRIDE Award for public relations pedagogy and the Janice Hocker Rushing Early Career Research Award from the Southern States Communication Association, Stokes has also received external funding from the North CarolinaHumanitiesCouncil and other agencies to support her research. Stokes teaches courses on Southern foodways, rhetoric, and public advocacy. Publications  Journal of Public Relations Research Public Relations Review Public Relations Inquiry Journal of Public Interest Communications Journal of Communication Management Southern Communication Journal  Teaching Courses  Consuming Southern Foodways Organizational Rhetoric Public Advocacy The Rhetoric of Foodways Appalachian Foodways  ", "academic_interests": ["", "", "", "activism", "american culture", "corporate communication", "corporate social responsibility", "culture", "food studies", "", "", "public advocacy", "public relations", "rhetoric", "rhetorical criticism", "social movements", "southern culture", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Communication Studies"}}, "Criminal Justice and Criminology": {"Anna Divita": {"link": "https://pages.charlotte.edu/connections/people/anna-divita/", "bio": " Lecturer           ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Criminal Justice and Criminology"}, "Beth Bjerregaard": {"link": "https://pages.charlotte.edu/connections/people/beth-bjerregaard/", "bio": "  Faculty CV Ph.D. (1991) State University of New York at Albany M.S. (1986) Kent State University B.S. (1985) Kent State University Dr. Bjerregaard teaches several of our legal courses as well as courses in research methods at both the graduate and undergraduate levels. Her research interests include the study of gang membership and its relationship to delinquent behaviors, capital punishment, and family violence. In researching these topics she has both employed quantitative methodology to the study of behaviors and engaged in legal analyses of the criminal justice system’s responses to such behaviors.   ", "academic_interests": ["", "", "", "capital punishment", "criminal justice system", "delinquent behaviors", "family violence", "", "", "gang membership", "legal analyses", "quantitative methodology", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Criminal Justice and Criminology"}}, "English": {"Aaron Gwyn": {"link": "https://pages.charlotte.edu/connections/people/aaron-gwyn/", "bio": "     Education  Ph.D. University of Denver M.A. Oklahoma State University B.A. East Central University  Area of Interest  Fiction Writing  Selected Publications and Presentations Books of Fiction: The World Beneath: A Novel. New York: W.W. Norton, 2009 Dog on the Cross: Stories. Chapel Hill: Algonquin Books of Chapel Hill, 2004. Stories in Anthologies and Textbooks: Drive,” New Stories from the South: The Year’s Best, 2010. Chapel Hill: Algonquin Books of Chapel Hill, 2010. 181-194. The Offering,” Where Love Is Found: 24 Tales of Connecion. New York: Simon and Schuster, 2006. 161-174. Of Falling,” Behind the Short Story: From First to Final Draft. New York: Longman-Pearson, 2006. 81-88. The Road to Tarshish,” A Dixis Christmas. Chapel Hill: Algonquin Books of Chapel Hill, 2005. 81-101. Of Falling,” New Stories from the South: The Year’s Best, 2002. Chapel Hill: Algonquin Books of Chapel Hill, 2002. 81-94. Selected Story Publications in Literary Magazines: Drive,” The Gettysburg Review 22.4 (2009): 509-519 The Gray,” Esquire. Esquire Magazine/Hearst Corporation, 24 April (2009). Look At Me,” McSweeney’s 24 (2007) Mate,” McSweeney’s 20 (2006): 232-45 The Offering,” Glimmer Train 57 (2006): 52-65. Visitation, Indiana Review 27.1 (2005): 158. Truck,” Black Warrior Review 29.2 (2003): 39-53. Grants: 2005 Fiction Fellowship from the North Carolina Council on the Arts Courses Taught:   ENGL 6070: Writing Fiction ENGL 5203/4203: Writing Fiction ENGL 3300: American Literature ENGL 2128: Introduction to Fiction Writing  Awards:  Short Story, Mate,” Originally Published in McSweeney’s, Selected by Stephen King as a Distinguished Story” in Best American Stories 2007 Finalist for the 2005 New York Public Library Young Lions Award for Dog on the Cross        ", "academic_interests": ["", "", "", "american literature", "fiction", "", "", "Fiction Writing", "writing", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "English"}, "Aaron Toscano": {"link": "https://pages.charlotte.edu/connections/people/aaron-toscano/", "bio": "Faculty Profiles Department of English College of Liberal Arts & Sciences–Digital Humanities CLAS Connections Research Resources American Contradiction–A Lesson from Colin Kaepernick’s Ordeal –excerpt from Video Games and American Culture (2020) Technical Writing Job Ad Analysis A Collection of Research Topics for Analysis News for anti-vaxers and COVID-19 vaccine History of Vaccines…goes back to 1000 CE to China  Current Courses (Fall 2021) LBST 2213 sec. 110: Science, Technology, and Society ENGL 4183/5183: Editing with Digital Technologies  Past Courses (recent–not all since 2006!) ENGL 2116-082: Introduction to Technical Communication ENGL 6008/6062 & WGST 6050: New Media–Gender, Culture, Technology ENGL 3051-D81: Topics in English–Science Fiction in American Culture (W) ENGL 4275: Rhetoric of Technology ENGL 6166: Rhetorical Theory LBST 2212 sec. 124, 125, 126, & 127: Literature & Culture–Science Fiction ENGL 4410/5410: Professional Internship (Contact Dr. Wickliff for more information) Forms available on the English Department Website ENGL 4182/5182: Information Design & Digital Publishing Creating a UNC Charlotte Personal Webpage ENGL 6008/MALS 6000: The Rhetoric of Technology ENGL 4750-091 & 5050-092: Video Games and Culture Honors course ", "academic_interests": ["", "", "", "american culture", "composition", "culture", "gender studies", "media", "new media studies", "popular culture studies", "", "", "rhetoric", "Science and Technology Studies", "sociology of technology", "technical communication", "technical writing", "Video Game Studies", "writing", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "English"}, "Alan Rauch": {"link": "https://pages.charlotte.edu/connections/people/alan-rauch/", "bio": "Education  Ph.D., Rutgers University (Literature) M.A., Rutgers University (Literature) M.A., Southern Illinois University (Zoology) B.Sc., McGill University (Biology)  Books  Dolphin– Reaktion Books, 2014. England in 1815: A Critical Edition of The Journal of Joseph Ballard– Palgrave MacMillan, 2009. Useful Knowledge: The Victorians, Morality, and the March of Intellect– Duke University Press, 2001. The Mummy!: A Tale of the Twenty- Second Century(1827), by Jane Webb (Reprint) – U. Michigan Press, 1994. One Culture: Essays in Science and Literature. Ed. George Levine. Asst. Ed. Alan Rauch – U. of Wisconsin Press, 1987.  Essays  Science, Women, and the Mother Tongue:Translating Knowledge for 19th Century Readers,” Under Review. Entry on Maria Hack. (1777–1844). Palgrave Encyclopedia of British Women Writers, 2021. Death as a Sacrament in Kingsley’s Water-Babies” in Jonathan Conlin and Jan Marten Ivo Klaver (eds.), Charles Kingsley: Faith, Flesh, and Fantasy. Routledge Studies in Cultural History, 2021.Pp. 184-201. The Sukotyro: On the Extinction of a Nonexistent Animal,” Configurations, Vol. 28 (1) 2020: 51-88. Ocean of Whales and Dolphins,” RISE: A Children’s Literacy Journal. Spring/Summer 2017. Science and Literature.” Blackwell Encyclopedia of Victorian Literature. Dino Felluga, Linda Hughes, and Pamela Gilbert, Eds. London, 2015. Ecce Emendator: The Cost of Knowledge for Scholarly Editors,” Chronicle of Higher Education, [https://chroniclevitae.com/news/285-ecce-emendator-the-cost-of-knowledge-for-scholarly-editors]. Scholarly Publishing: Hindsight Toward a Digital Future.”,J. of Scholarly Publishing, Vol. 42, Number 1 / October 2010, 56-67. The Pupil of Nature: Science and Natural Theology in Maria Hack’s Harry Beaufoy.” In Laurence Talairach-Vielmas, Ed., Science in the Nursery, Cambridge: Cambridge Scholar’s Press, 2011. The Scholarly Journal: Hindsight Toward a Digital Future,”Journal of Scholarly Publishing, Vol. 42, Number 1 / October 2010, 56-67. The Sins of Sloths: The Giant Ground Sloth as a Paleontological Parable,”Victorian Animal Dreams,Deborah Morse, Martin Danahay. Aldershot: Ashgate Press, 2007. Pp. 215-228. Mentoria: Women, Children, and the Structures of Science.”Nineteenth Century Contexts, Volume 27, Number 4, (December 2005), pp. 335-351. Great Work. You’re Fired.” [Program-Building and Disposable Labor: A Neglected Fourth Dimension in Evaluating Faculty],The Chronicle of Higher Education, April 1 2005. ” The Lacunae of Science: Observing the Unobserved in the Practices of Knowledge.”Interdisciplinary Science Reviews, Volume 28, No. 3, September 2003, pp. 209-216. Victorian Poetry and Science.” In The Blackwell Companion to Victorian Poetry, ed. Richard Cronin, Antony Harrison, and Alison Chapman. London: Blackwell, 2002.  Curated Exhibit & TedX Presentation  All Real Animals are Imaginary,” TedX – Charlotte. Feb. 6, 2021[https://www.youtube.com/watch?v=JZqadvWIbJo] Subverting the Natural Order: Women and Science, Baldwin Library of Historical Children’s Literature, University of Florida,November 2 – December 18, 2015  Areas of Interest  Science, Technology, and Culture The Long 18th Century, Romantic, & Victorian Literature & Culture Codifications of Knowledge Animal Studies The Graphic Novel Material Culture – The Meaning of Things History of the Book including New Media, Visualization, & Digital Publishing  Courses Taught  ENGL 4072/5072: The Bible as Literature ENGL 6680: British Women Writers in the 19th C. ENGL 6070: Dickens Bicentennial Seminar ENGL 6126: The Victorian Era ENGL/Honors 3050: Animals, Culture, and Society ENGL 3050: Jewish Identity & The Graphic Novel LBST 2213: Science, Technology, and Society HONR 3701:Science, Technology, and Human Values LBST 2102: Global and Intercultural Connections ENGL 3302: British Literature Survey II  Professional Activities  Advisory Board, Publications of the Modern Language Association (PMLA) -2019-2023 Chapter Head, Sigma Xi: The Scientific Research Honor Society (2020 – President: Council of Editors of Learned Journals (CELJ) Editor: Configurations: A Journal of Literature, Science, and Technology (Johns Hopkins) Past- President: Society for Literature, Science, and the Arts BOOK SERIES EDITOR, Intersections in Literature and Science, University of Wales Press, 2008- ADVISORY BOARD, Penn State University Press –Animalibus: Of Animals and Cultures, a series edited by Nigel Rothfels and Garry Marvin – 2011-2013 Modern Language Association, National Program Committee, 2008-2011 MLA Ad-Hoc Committee to Study the Feasibility of Changing the Convention Dates,” 1995-96  Fellowships and Awards  Mellon Fellowship, Library Company, Philadelphia 2019 Chancellor’s Diversity Grant, Jewish Identity & the Graphic Novel,” UNCCharlotte, 2008-09 Gilder Lehrman Institute of American Studies Fellowship, New York Public Library, New York, 2007 Boston Athenaeum Bicentenary Fellow, Boston 2006 Franklin Fellowship, American Philosophical Society, Philadelphia, 2005 Trent Dames Fellow in the History of Civil Engineering, Huntington Library, 2003-04 Centre for Research in the Arts, Social Sciences, and Humanities, Fellow, Cambridge University, 2003 C. P. Snow Fellowship, Harry Ransom Research Center, University of Texas, 2002 Fellowship for College and University Teachers, National Endowment for the Humanities 1992-93 Advanced Institute in the Humanities, University of Edinburgh, Fellow, 1992  Community Service  Charlotte Observer – Guest Writer Sunrise Assisted Living – Occasional Guest Speaker Charlotte Area Science Network (CASN) Carolina Actors Studio Theatre (CAST)  Feb. 06, 2021 ", "academic_interests": ["", "", "", "animal studies", "codifications of knowledge", "culture", "digital publishing", "History of the Book", "material culture", "natural theology", "", "", "new media", "romantic culture", "romantic literature", "technology", "victorian culture", "victorian literature", "visualization", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "English"}, "Balaka Basu": {"link": "https://pages.charlotte.edu/connections/people/balaka-basu/", "bio": "  Education Ph.D., English, Graduate Center of the City University of New York, 2012 B.A., English, Cornell University, 2004, cum laude Research Interests Children’s and Young Adult Literature New Media Studies & Digital Humanities Fan, Reception, and Audience Studies Television Studies Narrative Theory Adaptation Studies Queer Theory Novels of the Long” Nineteenth Century (British and North American) Early Modern/Renaissance Fiction Science Fiction and Fantasy Popular Culture Studies Genre Fiction Selected Publications and Presentations Books: Contemporary Dystopian Fiction for Young Adults: Brave New Teenagers. New York: Routledge, 2013. (co-edited with Katherine R. Broad and Carrie Hintz.) Essays: What Faction Are You In?: The Pleasure of Being Sorted in Veronica Roth’s Divergent.” Contemporary Dystopian Fiction for Young Adults: Brave New Teenagers. Eds. Balaka Basu, Katherine R. Broad, and Carrie Hintz. New York: Routledge, 2013: 19-34. Sherlock and the (Re)Invention of Modernity.” Sherlock and Transmedia Fandom. Eds. Louisa Stein and Kristina Busse. Jefferson, NC: McFarland Press, 2012: 196-209. When Worlds Continue: The Doctor’s Adventures In Fandom and Metatextuality.” Peregrinations, Ruminations, Regenerations: A Critical Approach to Doctor Who. Ed. Christopher Hanson. Newcastle-upon-Tyne: Cambridge Scholars Press, 2010: 164-176. Entries: A Scandal in Bohemia.” In Short Story Criticism. Detroit: Gale, 2014. (As editorial advisor.) Approaches to Teaching: Lady Mary Wroth.” In the Instructor’s Guide to the Broadview Anthology of English Literature, 2007. http://sites.broadviewpress.com/bablinstructors/ Actors.” In The Encyclopedia of Love, Courtship, and Sexuality through History Vol. 3: The Early Modern Period. Eds. Cherrie A. Gottsleben, Victoria Mondelli and Kristen P. Chew. Westport, CT.: Greenwood Press, 2007. Recent Presentations:  2013. Playing Along with Alcott, Montgomery, and Eager: The Evolution of Participatory Culture in Children’s Literature.” Children’s Literature Association; Biloxi, MS; June 13-15. 2013. ‘Nothing Gold Can Stay: Reading Apocalypse, Revelation, and Paradise (Not) Regained in Fan Fiction.” Modern Language Association; Boston, MA; January 3-6. 2012. ‘Matters of Predestination’: Writing Out-of-Order as Prophecy in L.M. Montgomery’s Journals and Fiction.” L.M. Montgomery Institute at the University of Prince Edward Island: L.M. Montgomery and Cultural Memory; Charlottetown, PEI (Canada); June 21-24. 2012. What Faction Are You In? The Pleasure of Being Sorted in Veronica Roth’s Divergent.” Children’s Literature Association; Boston, MA; June 14-16. 2012. Where We Have Gone Before: Mimicry and Repeated Imagery in Star Trek.” North East Modern Language Association; Rochester, NY; March 15-18. 2012. The Power of the Wound: Manifesting Trauma and Self Destruction in YA Fantasy Novels.” Modern Language Association; Seattle, WA; January 5-8. 2010. ‘It’s all real. I knew it!’: Metafiction, Belief and the Audience Embodied in SF/F Television.” Bristol Institute of Greece, Rome and the Classical Tradition & the Centre for Medieval Studies, University of Toronto: Desiring the Text, Touching the Past: Towards an Erotics of Reception; University of Bristol (UK); July 10. 2009. The Devil’s Parties: Regency Romance and The Byronic Hero in His Dark Materials.” North East Modern Language Association; Boston, MA; February 26 – March 1. 2008. When Worlds Continue: The Doctor’s Adventures in Fandom and Metatextuality.” Film and History; Chicago, IL; October 30 – November 2. 2007. ‘She Saved the World – A Lot’: Reading Fictional Universes and Writing Utopias in Buffy the Vampire Slayer.” Society for Utopian Studies; Toronto (Canada); October 4-7.  Courses Taught  ENGL 3103Children’s Literature  ENGL 4050/5050Special Topics: Digital Narratives for Young People  Professional Appointments Assistant Professor, University of North CarolinaatCharlotte: 2013-present. Adjunct Lecturer, Queens College, City University of New York: 2010-2013.       ", "academic_interests": ["", "", "", "adaptation studies", "audience studies", "children's literature", "digital humanities", "early modern fiction", "fan studies", "genre fiction", "Narrative theory", "new media studies", "", "", "nineteenth century novels", "popular culture studies", "queer theory", "reception studies", "science fantasy", "science fiction", "television studies", "young adult literature", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "English"}}, "Geography and Earth Sciences": {"Andy Bobyarchick": {"link": "https://pages.charlotte.edu/connections/people/andy-bobyarchick/", "bio": "Teaching and Research Interests  Kinematics of ductile shear zones Tectonics and regional geology of the Southern Appalachian Mountains Applied geophysics Online and non-traditional experiential geosciences education  Education  Ph.D. (1983) Geological Sciences, Albany State M.S. (1977) Geological Sciences, Virginia Tech B.S. (1974) Geology, Birmingham-Southern College  Profile My long-term research interests include the tectonics and regional geology of the Southern Appalachian Mountains, particularly within the eastern crystalline core of the chain. Numerous embedded orogen-parallel ductile shear zones in this area contain kinematic indicators for strike- or oblique-slip during mid- to late-Paleozoic deformation that is more characteristically compressional in the western part of the mountain belt. In addition to the Paleozoic kinematic significance of these structures, many shear zones also were reactivated to nucleate Mesozoic rift basins. I have continued to evaluate all of these relationships in field sites throughout North Carolina and Virginia. Part of my research in continuous deformation is theoretical. It is clear in many ductile shear zones that deformation cannot be exclusively pure shear or simple shear. This recognition leads to the need to establish models for shear that incorporate vorticity components of pure and simple shearing. The result of this analysis is the kinematic vorticity number, a measure of the balance between shearing components that has been found to be verifiable with field studies. This line of research is intermittent, but continues to be of interest. I also am involved in studies of neo-tectonics. In the Appalachians, neo-tectonics” often refers to the identification of structures that could be related to Tertiary and/or Quaternary activity. I have previously studied potential neo-tectonic areas along the Fall Line in eastern Virginia. Presently, I am planning an investigation of possible Quaternary faulting in the western Virginia Piedmont in the Mountain Run fault zone, which lies at the physiographic boundary between the Blue Ridge and Piedmont provinces. Recently I have been working with Missy Eppes and John Diemer to investigate an area of active deformation along the northern piedmont of the San Bernardino Mountains in California. There we have used ground-penetrating radar (GPR) to delineate sub-surface structures in an active faulted anticline. This work continues with additional near-surface geophysics and structural mapping to provide a model for the fault-fold relationship there. I teach applied geophysics and also use some of these tools in field research. In addition to the GPR work in California, with John Diemer and Missy Eppes and a class of graduate students we have done GPR profiles of pond sediment and colluvial debris in the western Piedmont of North Carolina. Also, with Craig Allan and John Diemer we have compiled a grid of GPR profiles in Ontario, Canada to assist in the study of the sub-surface component of a watershed study. I am currently involved in an on-going research project with John Diemer and Missy Eppes to study the source and distribution of home radon in the eastern Inner Piedmont of North Carolina. This project area, which is funded by the NC Radiation Protection Office, is located where radon concentrations are known to be above background values for the region. I maintain a program of outreach and innovation in geoscience education. For several years, I have taught an intense, hands-on summer institute for in-service K-12 schoolteachers. This field- and lab-based course is oriented on content and experience. I also am actively involved in developing online physical geology courses for non-science majors or teachers through UNC Charlotte and through the UNC general administration. ", "academic_interests": ["", "", "", "applied geophysics", "geological sciences", "geology", "geology and mechanics of rock deformation", "geology of ductile shear zones", "geology of North Carolina", "geology of rift basins", "", "", "geology of the southern Appalachian Mountains", "Geology of Virginia", "ground penetrating radar", "kinematic indicators in geology", "near surface geophysics", "structural geology", "tectonics", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Geography and Earth Sciences"}}, "Global Studies": {"Amal Khoury": {"link": "https://pages.charlotte.edu/connections/people/amal-khoury/", "bio": "       ASSISTANT PROFESSOR OF INTERNATIONAL STUDIES             ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Global Studies"}}, "History": {"Aaron Shapiro": {"link": "https://pages.charlotte.edu/connections/people/aaron-shapiro/", "bio": "A Chicago native, Aaron Shapiro arrives at UNC Charlotte as thenew Director of Public Historyafter spending 5 years at Auburn University, where he started and directed the public history program. He previously served as national historian for the US Forest Service in Washington, DC, where he was involved with a wide variety of public history projects including historical films, websites, oral histories, interpretive planning, exhibit development, historic preservation, and heritage tourism initiatives. In addition, Shapiro worked on collections management and federal records issues and regularly provided historical policy papers for staff. As agency historian, he developed relationships with interagency and non-profit partners to further the goals of the agency history program. Before joining the Forest Service, Shapiro was Assistant Director of the Scholl Center for Family and Community History at Chicago ‘s Newberry Library. At the Newberry he served as academic director for two Department of Education Teaching American History grants, working cooperatively with the Chicago Public Schools and Chicago-area cultural and non-profit institutions. Shapiro received his MA and PhD in History from the University of Chicago and a BA in History from the University of Pennsylvania. He is particularly interested in questions regarding the intersection of people and place, changing perspectives of the cultural and natural landscape, and connections between memory, heritage, and public historical interpretation. His research explores questions about the history of land use and environmental change, modern environmental politics, the relationship between work and leisure, and broader cultural transformations in twentieth century urban and rural America. He has served as chair of the Education Committee of the American Society for Environmental History and as vice chair of the Alabama Historical Commission National Register Review Board. Education BA, University of Pennsylvania PhD, MA, University of Chicago Recent Publications Book  The Lure of the North Woods: Cultivating Tourism in the Upper Midwest (University of Minnesota Press, 2013).  Journal Articles and Book Chapters   ‘Follow the Arrows to the Arrowhead’: The Environment of Tourism in the Interwar Years.” In George Vrtis and Christopher W. Wells, eds, Nature’s Crossroads: The Twin Cities and Greater Minnesota, Under contract with the History of the Urban Environment series, ed. Martin Melosi and Joel Tarr, University of Pittsburgh Press. A Grand Experiment: USDA Forest Service Experimental Forests and Ranges” in Deborah Hayes, Susan Stout, Ralph Crawford, and Anne Hoover eds., USDA Forest Service Experimental Forests and Ranges: Research for the Long Term (Springer, 2014), 3-23. ”‘Air Conditioned by the Cool Breezes of Lake Superior’: Vacationing in Michigan’s Copper Country After World War Two,” in Kim Hoagland, Terry Reynolds, and Erik Nordberg, eds.,New Perspectives on Michigan’s Copper Country(Houghton, MI: Quincy Mine Hoist Association, 2007), 135-152. ”Up North on Vacation: Tourism and Resorts in Wisconsin ‘s North Woods,” Wisconsin Magazine of History (Summer 2006): 2-13.  Promoting Cloverland: Regional Associations, State Agencies, and the Creation of Michigan’s Upper Peninsula Tourist Industry,”Michigan Historical Review29 (Spring 2003): 1-37.  Encyclopedia Essays  Wisconsin Dells, Indiana Dunes, Ozarks, and Spas” in Richard Sisson, Christian Zacher, and Andrew Cayton, eds., The American Midwest: An Interpretive Encyclopedia (Bloomington: Indiana University Press, 2007).  Book Reviews William Boyd, The Slain Wood: Papermaking and Its Environmental Consequences in the American South in Enterprise and Society 18 (March 2017): 242-244. Michael R. Federspiel with contemporary photographs by Rebecca Zeiss. Little Traverse Bay: Past and Present in Middle West Review 3 (Fall 2016): 152-154. John F. Freeman, Black Hills Forestry: A History in Pacific Historical Review 85 (August 2016): 458-459. Mason C. Carter, Robert Kellison, and R. Scott Wallinger, Forestry in the U.S. South: A History in North Carolina Historical Review XCIII (July 2016): 352-353. James R. Skillen, Federal Ecosystem Management Its Rise, Fall, and Afterlife in The Public Historian 38 (May 2016): 109-111. David R. Foster, ed. Hemlock: A Forest Giant on the Edge in Environmental History (October 2015): 843-845. Char Miller, Seeking the Greatest Good: The Conservation Legacy of Gifford Pinchot, in Agricultural History (Summer 2015): 466-468. David M. Wrobel, Global West, American Frontier: Travel, Empire, and Exceptionalism from Manifest Destiny to the Great Depression in Chronicles of Oklahoma (Winter 2014-15): 499-501. Sarah Mittlefehldt, Tangled Roots: The Appalachian Trail and American Environmental Politics in North Carolina Historical Review (July 2014): 376. Judith Koll Healey, Frederick Weyerhaeuser and the American West in Environmental History (April 2014): 401-403. Ellen Stroud, Nature Next Door: Cities and Trees in the American Northeast in Environmental History (October 2013): 811-812. Richard Widick, Trouble in the Forest: California’s Redwood Wars in Environmental History 17 (October 2012): 883-885. Thomas R. Cox, The Lumberman’s Frontier: Three Centuries of Land Use, Society, and Change in America’s Forests in Environmental History 16 (April 2011): 364-365. Char Miller, Ground Work: Conservation in American Culture in Environmental History 14 (July 2009): 571-572. Blake Harrison, The View From Vermont: Tourism and the Making of an American Rural Landscape in Environmental History 12 (July 2007): 692-693. Selected Public History Projects and Grants  Project Director, Preserving Memory in a Digital Age: Charlotte-Eastern Europe Cemetery Experience, 2016-2020, Funded by a $47,500 grant from the Blumenthal Foundation and $7500 grant from the Jewish Federation of Metropolitan Charlotte Curator, Undergraduate Student Exhibitions for Carolina Actors Studio Theatre’s performance of Angels in America, Charlotte, NC, May 2014. USDA Forest Service Region 8 (Southern Region) Oral History Project, August 2012-September 2013. ($30,000 contract). Auburn University Virtual War Memorial, July 2011-August 2013. Co-Organizer, Intersections and Meeting Grounds: Public History and Community Conference, February 17-18, 2012, Auburn, AL. A Grand Experiment: 100 Years of Experimental Forests and Ranges and Counting.” Film Advisor and Script Development. U.S. Forest Products Lab Centennial Oral History Project, A Cooperative Project of the USDA Forest Service, USDA Forest Products Lab, University of Wisconsin Oral History Program, and University of Wisconsin Digital Collections. Research Interests Modern United States, public history, environmental history, global heritage, historic preservation, history and new media, and oral history. Courses Taught (Auburn University) HIST 2020 US History, 1865-Present HIST 3550 American Environmental History HIST 3800 Historian’s Craft HIST 3970 History of the American West HIST 3970 Forest and Agricultural History HIST 4950 Senior Thesis HIST 4967 Honors Special Problems HIST 5810/6810 Fundamentals of Public History HIST 5820 Historic Preservation and Cultural Resource Management HIST 5970/6970 Museum Studies HIST 7180 Seminar in Modern US History HIST 7810 Research Seminar in US History Since 1865 HIST 7910 Public History Internship HIST 7970 Digital History and New Media ", "academic_interests": ["", "", "", "environmental history", "global heritage", "historic preservation", "history and new media", "", "", "modern United States", "oral history", "public history", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "History"}, "Amanda Anderson": {"link": "https://pages.charlotte.edu/connections/people/amanda-anderson/", "bio": "Research Interests Early Modern Europe; women and gender; sexuality; identity formation; cultural history; the Netherlands, Germany. Current Projects (1) Dissenting Daughters: Reformed Women in the Dutch Republic, 1572-1725highlights women’s contributions to the spread of the Reformed faith by examining the lives and written works of six women, Cornelia Teellinck (1553-1576), Susanna Teellinck (1551-1625), Anna Maria van Schurman (1607-1678), Sara Nevius (1632-1706), Cornelia Leydekker (1654-1725), and Henrica van Hoolwerff (1658-1704). These women drew upon the authority accorded to them as domestic religious instructors, as well as their family networks and ministerial connections, to teach others and to publish original works to amplify the influence of the nascent Dutch Reformed Church that excluded them from official roles. (2) I am also working on a book-length project that traces the international spread of domestic advice books in response to religious persecution, trade, and voluntary travel. It compares the content of advice to parents printed in German, Dutch, English, and French and identifies women active within these networks of religious exchange to highlight instances in which ministers provided women with the tools to write and publish devotional texts by insisting that women engage in domestic religious practices including reading and writing devotional texts, offering religious instruction, and even leading home worship services. Publications: Books:  Rape and the Republic, 1609-1725: Formulating Dutch Identity. Leiden:Brill, 2013. Dissenting Daughters: Reformed Women’s Religious and Political Activism, 1550-1700 (in progress). Women and Gender in the Early Modern Low Countries, 1500-1750, co-edited with Sarah Moran, (Leiden: Brill, 2019). Available in Open Access.  Articles:  Women’s Writing during the Dutch Revolt: the Religious Authority and Political Agenda of Cornelia and Susanna Teellinck, 1554–1625,” in Women and Gender in the Early Modern Low Countries (Leiden: Brill, 2019). ‘They were not humans, but devils in human bodies’: Depictions of Sexual Violence and Spanish Tyranny as a Means of Fostering Identity in the Dutch Republic,” Journal of Early Modern History vol. 13 (no. 4) 2009, p. 229-264. Every Woman’s Fear: Stories of Rape and Dutch Identity in the Golden Age,” Tijdschrijft voor Geschiedenis vol. 122 (no. 3) 2009, p. 290-305.  Blog: Pipkin, Susanna Teellinck, the Earliest Known Dutch Reformed Woman Editor and Biographer” on Martine van Elk, Early Modern Women: Lives, Texts, Objects (https://martinevanelk.wordpress.com/) [July 2019]. Conference Co-organizer:  Considering Early Modern Women in the Low Countries: An International Conference, April 24-25, 2015 at the Rubenianum in Antwerp.  Speaking Engagements and Book Reviews: *Click here for a list of all book reviews and speaking engagements *Click here for some articles and book reviews available on Academia.edu  Royal Institute of the Tropics, Amsterdam (June 2017)         Education Ph.D., Rutgers University, 2007 M.A. Leiden University, The Netherlands, 1999 B.A. Wake Forest University, 1997 Courses Taught Theses Directed ", "academic_interests": ["", "", "", "cultural history", "early modern Europe", "history of women", "identity formation", "", "", "Protestant women", "sexuality", "the Netherlands", "women and gender", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "History"}, "Benny Andres": {"link": "https://pages.charlotte.edu/connections/people/benny-andres/", "bio": "Curriculum Vitae 2020 Publications  Power and Control in the Imperial Valley: Nature, Agribusiness, and Workers on the California Borderland, 1900-1940 Connecting the Greater West Series (College Station: Texas A&M University Press, 2015). Published in paperback April 2016 Invisible Borders: Repatriation and Colonization of Mexican Migrant Workers along the California Borderlands during the 1930s,”California History88, no. 4 (September 2011): 5-21, 63-65. ‘I Am Almost More at Home with Brown Faces than with White’: An Americanization Teacher in Imperial Valley, California, 1923-1924,”Southern California Quarterly93, no. 1 (Spring 2011): 69-107. Chicano/a movement,” in Kathleen A. Brosnan, ed.,Encyclopedia of American Environmental Historyvol. 1 (New York: Facts on File, 2011): 268-270. Chacón, Soledad Chávez (1890-1936),” in Vicki L. Ruiz and Virginia Sánchez Korrol, eds.,Latinas in the United States: A Historical Encyclopediavol. 1 (Bloomington: Indiana University Press, 2006): 143-144. Mendoza, María Estela Altamirano (1948-),” in Vicki L. Ruiz and Virginia Sánchez Korrol, eds.,Latinas in the United States: A Historical Encyclopediavol. 2 (Bloomington: Indiana University Press, 2006): 448-449. La Plaza Vieja (Old Town Alburquerque): The Transformation of a Hispano Village, 1880s-1950s,” in Erlinda Gonzales-Berry and David R. Maciel, eds.,The Contested Homeland: A Chicano History of New Mexico(Albuquerque: University of New Mexico Press, 2000): 239-268.    Research Interests Latinx History; U.S.-Mexico Borderlands; 20th century U.S. West; Environmental History; Labor History; Food Studies Courses Taught  Latino History Since 1900 History of the American West U.S.-Mexico Borderlands Since 1900 US Food History Since Colonial Era Seminar U.S. History Since 1865 Survey U.S. History Since 1865 Immigration & Americanization during the Progressive Era Environmental Justice in the U.S. & Latin America  Education: Ph.D. University of New Mexico, 2003 Current Projects: My new book project is Indispensable River: La Compañía de Terrenos y Aguas de la Baja California Shaping the Lower Colorado River Region, 1895-1962. I am also working on 2 articles: Border Jumpers: Prosecuting Americans for illegally entering the U.S. from Mexico, 1924-1932″ and ‘Tainted Water’: Tucson’s Groundwater Carcinogenic Plume” ", "academic_interests": ["", "", "", "american west", "borderlands", "environmental justice", "", "", "labour relations", "mexican american history", "race relations", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "History"}}, "Languages and Culture Studies": {"Allison Stedman": {"link": "https://pages.charlotte.edu/connections/people/allison-stedman/", "bio": "Education  Ph.D., University of Pennsylvania, 2002 (French Literature) M.A., University of Pennsylvania, 1999 (French Literature) A.M., Dartmouth College, 1997 (Comparative Literature; French, Italian, Spanish) A.B., magna cum laude, Dartmouth College, 1996 (Comparative Literature; French, Italian)   Profile As a literary historian specializing in French cultural history, my goal is to help students learn to read texts on multiple levels, analyzing not only their content, but also their form and style. My classes are designed to encourage students to look beyond what a text communicates overtly in the plot, focusing instead on how ideas are embedded and repeated as narrative patterns that are generally unconsciously produced by the author. Unearthing an author’s implicit cultural biases enables us to learn more about the ways in which people related to the world around them during the time period in which the text was created. Before arriving at UNC-Charlotte, I taught at Bucknell University from 2002-2007.  Links  Bucknell University Press Profile Social Media had precedent in 17th century (Charlotte Observer article) French Major Eileen Jakeway Wins First Prize at the Charlotte Research Scholars Symposium CLAS Professor Receives Prestigious NEH Fellowship NEH Public Query Form   Research and Teaching Interests  Early Modern / early Enlightenment French literature Literature’s role in creating Enlightenment Culture Experimental literature, particularly generic hybrids Intersections between literature, music and the fine arts in France and Italy Relationships between mental processes and physical symptoms during the early modern period Early Modern French Pilgrimage Practices   Books In Progress The Mind-Body Connection in Early-Modern France, 1580-1715: Metaphysics, Mysticism, Miracles, Medicine Project funded by an NEH faculty fellowship (spring-fall 2017) and by a Franklin Grant from the American Philosophical Society (summer 2013).   In Print        Rococo Fiction in France, 1600-1715: Seditious Frivolity. Lewisburg, PA: Bucknell UP, hardcover 2013. Winner Outstanding Academic Title 2013” by Choice Book Awards. / Reprinted in paperback, 2014. https://rowman.com/ISBN/9781611484373/Rococo-Fiction-in-France-1600—1715-Seditious-Frivolity  Henriette-Julie de Castelnau comtesse de Murat. Voyage de campagne. Critical Edition by Allison Stedman. Rennes: Presses Universitaires de Rennes, 2014. http://www.pur-editions.fr/detail.php?idOuv=3368  A Trip to the Country: by Henriette-Julie de Castelnau, Comtesse de Murat. Intro. Allison Stedman, Ed. and Trans. Perry Gethner and Allison Stedman. Detroit MI: Wayne State University Press, 2011. http://www.wsupress.wayne.edu/books/detail/trip-country   Selected Articles and Book Chapters  Secret History in Pre-Revolutionary France.” In Secret History in the Long Eighteenth Century. Ed. Rachel Carnell and Rebecca Bullard (Cambridge, UK: Cambridge University Press, 2017) 205-15. Lafayette Rewrites History, Murat Rewrites Lafayette: the Novel and the Transfiguration of the Social Sphere in Old-Regime France.” Cahiers du dix-septième: An Interdisciplinary Journal XIV (2012) 1-21.  ‘The Savage’ by Henriette-Julie de Castelnau, comtesse de Murat,” trans. Allison Stedman, in Marvelous Transformations: An Anthology of Tales and New Critical Perspectives, Ed. Christine Jones and Jennifer Shacker (Ontario: Broadview, 2012) 201-218. Jean Racine, Marie-Jeanne Lhéritier de Villandon, and Charles Perrault: A Revised Triumvirate,” in Options for Teaching 17th and 18th-Century French Women Writers. (New York: Modern Languages Association of America, 2011) 101-108. Prolepic Subversion: Longing for the Middle Ages in the Fin-de-siècle French Fairy Tale.” The Romanic Review 99:2 (2008) 369-386. Teaching the Interdisciplinary Seventeenth-Century to Undergraduates: A Literary Historian’s Perspective,” Cahiers du dix-septième: An Interdisciplinary Journal XI: 1 (2006) 103-122.  D’Aulnoy’s Histoire d’Hypolite, comte de Duglas (1690): a Fairy-Tale Manifesto,” Marvels & Tales: Journal of Fairy-Tale Studies 19:1 (2005) 32-53.  ", "academic_interests": ["", "", "", "comparative literature", "experimental literature", "", "", "fairy tales", "french literature", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Ana-Isabel Aliaga-Buchenau": {"link": "https://pages.charlotte.edu/connections/people/ana-isabel-aliaga-buchenau/", "bio": "Anabel Aliaga-Buchenau is Associate Professor of German. Currently she is serving a three year term as Associate Chair of the Department of Languages and Culture Studies. She was a finalist of the prestigious Bank of America Teaching Award in 2012, a nominee for the Carnegie/Case Professor of the Year in 2011 and from 2009-2012 she was honored with the Bonnie E. Cone Teaching Professorship at UNC Charlotte. A native of Germany, she has worked for years at increasing the number of German Majors at UNC Charlotte. During her time as coordinator of the German program the number of Majors increased from 32 to 110. Her outreach work with the German community of the greater Charlotte region has resulted in cooperation with the German Language and Culture Foundation. Through this partnership, each year thirty students receive a scholarship of $2000 to study in Germany during the summer. In addition, students have numerous opportunities to work as interns in German-American companies here in Charlotte or in Germany through her efforts. Buchenau takes pride in the vibrant German program at UNC Charlotte. In her research, Buchenau focuses on 19th century immigrants from Germany and their literary production. In particular, she is interested in women immigrants to the Americas. She is currently working on the translation of a Mexican general’s memoir from Spanish to English. Her research enhances her teaching expertise. She teaches upper level German classes as well as translation classes. Education Ph.D. Comparative Literature, The University of North Carolina at Chapel Hill. (1997) Staatsexamen,Georg-August Universität Göttingen, Germany (1993) M.A. Comparative Literature, The University of North Carolina at Chapel Hill (1991) Zwischenprüfung (B.A. equivalent) Georg-August Universität Göttingen, Germany (1989)  Appointments Associate Chair, Department of Languages and Culture Studies, UNC Charlotte, 2014-present Associate Professor of German and Comparative Literature, UNC Charlotte, 2006-present. Assistant Professor of German and Comparative Literature, UNC Charlotte, 2002-06. Visiting Assistant Professor of English and German, Davidson College, 2000-02. Visiting Assistant Professor of Honors, University of Southern Mississippi, 1997-99.  Awardsand Honors  Bank of America Teaching Award, Finalist, 201 Carnegie/Case Professor of the Year, Nominee, 2011 Bonnie E. Cone Teaching Professorship, UNC Charlotte, 2009-2012 Faculty Research Grant, UNC Charlotte, 2009 Faculty Research Grant, UNC Charlotte 2007 CID Grant, UNC Charlotte, 2005 Junior Faculty Research Grant, UNC Charlotte, 2005 Faculty International Travel Grant, UNC Charlotte, 2004 Thyssen Junior Faculty Travel Grant, Thyssen Foundation, 2004 Faculty Travel Grant, Southern Regional Education Board, 2003 Faculty Travel Grant, Southern Regional Education Board, 2002 Junior Faculty Research Grant, University of North Carolina at Charlotte, 2002  Specific Research Interests  Holocaust Women in literature Immigration German literature in the nineteenth century Realism Naturalism Translation (German <-> English, Spanish->English)  ", "academic_interests": ["", "", "", "comparative literature", "english literature", "german literature", "immigration", "", "", "linguistics", "naturalism", "realism", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Anastasia Koralova": {"link": "https://pages.charlotte.edu/connections/people/anastasia-koralova/", "bio": "     Education    Ph.D., Linguistics,Moscow Linguistic University (1978) M.A., Languages and Literature, MoscowState University (1965)   Koralova CV 2012 Publications Russ-Eng: Are We Getting Closer? Anglicisms in Russian,” Bridges, 4 (24), translators and Interpreters’ Journal, Moscow, Russia 2009. Friendly Russian, Introductory Course of Russian, Part I. Moscow Linguistic Society, Moscow. (2008) Textbook of English-to-Russian Translation,” with translation exercises keys. Revised edition, co-authored with S.P. Romanova, KDU Publishing, Moscow. (2005) The Role of Culture in Translation,” Proceedings of 45th ATA (American Translators Association) Conference, Toronto, Canada, 2004. Recent Presentations Russian-English: Are we getting closer?” ATA 49th conference, Orlando. FL (2008) English Invasion of Russian: Its Plusses and Minuses” (in Russian), and Teaching Russian Grammar through Poems” (in Russian), conference on Russian Language and Culture in the United States: Practical Issues in Preservation and Development, Washington, DC (2007) Idioms: A Major Source of Mistakes in Translation.” 46th Annual Conference of ATA (American Translators Association), Seattle,2005.      ", "academic_interests": ["", "", "", "culture in translation", "english invasion", "english to russian translation", "language and culture", "", "", "moscow state university", "russian grammar", "russian language", "translators and interpreters", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Angela Jakeway": {"link": "https://pages.charlotte.edu/connections/people/angela-jakeway/", "bio": "Senior Lecturer German Director for Certificate of German for Business German American Exchange Program Coordinator German Coordinator German Advisor Education  M.A.T. (German) Summa cum laude, University of North CarolinaatCharlotte M.A., University of Applied Sciences, Pforzheim, Germany  SCHOLARLY PRESENTATIONS Anna Wimschneider: Die Herbstmilch”: Incorporating Bavarian dialect and culture into the German-language classroom through translation. Asheville, NC, February, 2019  How including an eye witness from the Cold War in the L2 classroom changes the lives from your students”, South Atlantic Modern Language Association, SAMLA,  Birmingham, Alabama , November 3rd – 5th, 2018  Rammstein” and Romanticism, Mozart and Albrecht Dűrer”: Music and Art in the  German classroom”, The Philological Association of the Carolinas, PAC, Citadel in  Charleston, South Carolina, February 22nd – 25th 2018 Cold War Eyewitness including in L2 classroom”, South Atlantic Modern Language Association, SAMLA, Jacksonville, FL, November 3-5, 2017 Grow your Foreign Language Program through study abroad and internships opportunities”, Mountain Interstate Foreign Language Conference, MIFLC 2017, Wilmington, NC, October 4-6, 2017  Diversity, Decolonialization, and the German Curriculum”, University of Asheville,  Asheville, NC, March 2– 5, 2017  Cold War Eyewitness Inclusion in L2 Classroom” South Atlantic Modern Language Association, SAMLA, Jacksonville, FL, November 4-6, 2016.   How to build up a Real-World Network by learning German”, Philological Association of the Carolinas, Charlotte, NC, April 7–8, 2016.  Bridging the Gap between the L2 classroom and the real world”, Southern Conference at Language Teaching , SCOLT, Charlotte, NC, February 18-20, 2016. Learning by Doing: German in the Business World”, South Atlantic Modern Language Association, SAMLA, Durham, November 13-15, 2015. FOLDABLES”, Foreign Language Association in North Carolina, FLANC Conference, October 7th – 8th ,2010    PUBLICATIONS  Hutchison, C, A. Jakeway. What happens when students are in the minority: experiences that impact human performance. A German’s visit to a Latino church, and German Sensibilities at a Super Bowl Party. Lanham: Rowan & Littlefield Education, 2009. Jakeway, Angela. Handbook Caup, Landeskreditbank, Karlsruhe, Germany, 1990. Jakeway, Angela. Moderne Verfahren zur Unterstützung der Kundenberatung in der Landeskreditbank, Karlsruhe, Germany, 1990. ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Ann Gonzalez": {"link": "https://pages.charlotte.edu/connections/people/ann-gonzalez/", "bio": "Professor and Chair     Education  Ph.D., Comparative Literature, University of South Carolina, Columbia (1983) M.A., Comparative Literature, University of South Carolina, Columbia (1975) B.A., English, University of North Carolina, Chapel Hill (1971)       Areas of Specialization Central American literature, Spanish American narrative, Hispanic Children’s literature, Literary translation, children’s literature, Latin America, Central America, narrative, novel, short story, language pedagogy, translation studies ", "academic_interests": ["", "", "", "american literature", "comparative literature", "", "", "literary translation", "spanish american", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Anton Pujol": {"link": "https://pages.charlotte.edu/connections/people/anton-pujol/", "bio": "     Education   M.B.A., International Business and Marketing, University of Chicago (2002) Ph.D., Nineteenth and Twentieth Century Pennisular Literature, University of Kansas (1998) M.A., Spanish Literature, University of South Carolina (1992) B.A., Universitat Autònoma de Barcelona, Bellaterra, Spain (1989)       ", "academic_interests": ["", "", "", "19th century pennisular literature", "20th century pennisular literature", "", "", "international business", "international marketing", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}, "Aura Lawson-Alonso": {"link": "https://pages.charlotte.edu/connections/people/aura-lawson-alonso/", "bio": "UNC Charlotte Pages is an instance of WordPress provided by the CLAS Office of Academic Technologies designed to host a variety of sites, including those for profiles, projects, research and blogs. Faculty Connections Faculty Connections is an aggregation of UNC Charlotte faculty profiles. Full-time faculty who want to update their profile information, see:Connection Update UNC Charlotte faculty and staff can log in with their NinerNET user accounts. College of Liberal Arts & Sciences The College of Liberal Arts & Sciences uses UNC Charlotte Pages for faculty profile sites, see: CLAS Pages College of Health & Human Services The College of Health & Human Services is currently usingUNC Charlotte Pages for its faculty and staff, see: Connections > CHHS Belk College of Business TheBelk College of Business uses UNC Charlotte Pages for its faculty and staff, see: Belk College Pages College of Arts & Architecture The College of Arts & Architecture is currently usingUNC Charlotte Connections, see: Connections >COAA The William States Lee College of Engineering The College of Engineering also has its own instance of WordPress, see:WordPress for the College of Engineering Faculty & Staff ", "academic_interests": ["", "", "", "applied ethics", "latin american studies", "", "", "translation studies", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Languages and Culture Studies"}}, "Mathematics and Statistics": {"Adalira Saenz-Ludlow": {"link": "https://pages.charlotte.edu/connections/people/adalira-saenz-ludlow/", "bio": "Professor of Mathematics Education Ed.D., University of Georgia ", "academic_interests": ["", "", "", "mathematics education", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Adriana Ocejo Monge": {"link": "https://pages.charlotte.edu/connections/people/adriana-ocejo-monge/", "bio": "Research areas of interest  Mathematical finance: derivatives pricing, stochastic volatility, interest rate modeling, portfolio allocation, variable annuities, indifference pricing, reinsurance. Stochastic optimal control: optimal stopping, controlled diffusion processes, hybrid switching diffusions, martingale methods.  Publications  (2014)-Monotonicity of the value function of a two-dimensional optimal stopping problem.With S. Assing and S. Jacka.In Annals of Applied Probability.[Link][Preprint] (2014)- Time-change and control of stochastic volatility. PhD Thesis. [PDF] (2018)- On the regularity of American options withregime-switching uncertainty.With S. Jacka. In Stochastic Processes and their Applications. [Link] [Preprint] (2018) Asian option as a fixed-point. InJournal of Fixed Point Theory and Applications.[Link][Preprint] (2018) Explicit solutions to utility maximization problems in a regime-switching market model via Laplace transforms. In Nonlinear Analysis: Hybrid Systems. [Link] [Preprint] (2019)Assessing Guaranteed Minimum Income Benefits and rationality of exercising reset options in variable annuities. With R. Jones. In International Journal of Statistics and Probability. [Link] (2020) Integral equation characterization of the Feynman-Kac formula for a regime-switching diffusion. In Results in Applied Mathematics. [Link].  Submitted  Portfolio optimization with a guaranteed minimum maturity benefit and risk-adjusted fees. With Anne MacKay. [Preprint]  Education  PhD in Statistics (2014), University of Warwick, UK. Time-change and control of stochastic volatility. MSc in Mathematics (2009), Universidad de Sonora, Mexico.American option pricing as a free-boundary problem. BSc in Mathematics (2007), Universidad de Sonora, Mexico.The Henstock-Kurzweil integral and the Fundamental Theorem of Calculus (in Spanish).  ", "academic_interests": ["", "", "", "actuarial science", "controlled diffusion processes", "derivatives pricing", "indifference pricing", "interest rate modeling", "mathematical finance", "optimal stopping", "portfolio allocation", "", "", "probability", "reinsurance", "stochastic calculus", "stochastic optimal control", "stochastic processes", "stochastic volatility", "variable annuities", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Aziz Issaka": {"link": "https://pages.charlotte.edu/connections/people/aissaka/", "bio": "  ASSISTANT PROFESSOR OF MATHEMATICS        Probability and Stochastic Department Profile Page   ", "academic_interests": ["", "", "", "probability", "", "", "stochastic processes", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Alan Dow": {"link": "https://pages.charlotte.edu/connections/people/alan-dow/", "bio": "        PROFESSOR OF MATHEMATICS     Alan Dow’s Faculty PageTopology Department Profile Page     ", "academic_interests": ["", "", "", "topography", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Allison Hahn": {"link": "https://pages.charlotte.edu/connections/people/allison-hahn/", "bio": "  LECTURER     Department Profile Page     ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Allison McCulloch": {"link": "https://pages.charlotte.edu/connections/people/amccul11/", "bio": "  ASSISTANT PROFESSOR OF MATHEMATICS EDUCATION        Mathematics Education Department Profile Page   ", "academic_interests": ["", "", "", "mathematics education", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Anna Athanasopoulou": {"link": "https://pages.charlotte.edu/connections/people/anna-athanasopoulou/", "bio": "       LECTURER     Mathematics Education Department Profile Page     ", "academic_interests": ["", "", "", "mathematics education", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Anthony Fernandes": {"link": "https://pages.charlotte.edu/connections/people/anthony-fernandes/", "bio": "Research   My research examines the intersection of language and mathematics within the context of a rapidly growing school population of emerging bilingual students across the US. I examine two interlinked areas of multimodal mathematics explanations by emerging bilingual students and preparing future mathematics teachers to work with these students in their classrooms. In the area of mathematical communication, I am interested in how emerging bilingual students go beyond verbal speech to draw on resources such as gestures, concrete materials, and drawings, to make meaning and justify their mathematical thinking. I draw on this research and research related to teacher beliefs to prepare future mathematics teachers to work with emerging bilingual students. Recently, I have extended my research with preservice teachers to teaching mathematics for social justice, with a special focus on understanding systemic racism, through the statistical analysis of publicly available datasets. ", "academic_interests": ["", "", "", "mathematical communication", "mathematical thinking", "", "", "mathematics education", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}, "Arindam Roy": {"link": "https://pages.charlotte.edu/connections/people/aroy15/", "bio": "       ASSISTANT PROFESSOR OF MATHEMATICS        Arindam Roy’s Faculty HomepageAlgebra, Combinatorics and Number Theory  Department Profile Page  ", "academic_interests": ["", "", "", "algebra", "combinatorics", "", "", "number theory", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Mathematics and Statistics"}}, "Philosophy": {"Andrea Pitts": {"link": "https://pages.charlotte.edu/connections/people/andrea-pitts/", "bio": "Andrea Pitts (they/them) is Associate Professor of Philosophy at UNC Charlotte and is affiliate faculty of the university’s Department of Africana Studies, the Center for Holocaust, Genocide, and Human Rights Studies, the Latin American Studies Program, the School of Data Science, the Social Aspects of Health Initiative, and the Women’s and Gender Studies Program. Their research interests include Latin American and U.S. Latinx philosophy, critical philosophy of race, feminist philosophy, and critical prison studies, and they have taught graduate and undergraduate courses on topics such as Latina/x feminist philosophy, queer migration studies, prison abolitionism, critical transgender politics, and feminist epistemology. Andrea is author of Nos/Otras: Gloria E. Anzaldúa, Multiplicitous Agency, and Resistance (SUNY Press 2021), and co-editor of Beyond Bergson: Examining Race and Colonialism through the Writings of Henri Bergson with Mark Westmoreland (SUNY Press 2019) and Theories of the Flesh: Latinx and Latin American Feminisms, Transformation, and Resistance with Mariana Ortega and José M. Medina (Oxford University Press 2020). Andrea also co-organizes, along with Perry Zurn, the Trans Philosophy Project, a professional and research initiative dedicated to supporting trans, nonbinary, and gender variant philosophers.    ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Philosophy"}}, "Physics and Optical Science": {"Angela Davies": {"link": "https://pages.charlotte.edu/connections/people/angela-davies/", "bio": "Courses  OPTI 6102/8102 Principles of Geometrical and Physical Optics OPTI 8105/8105 Optical Properties of Materials Physics 1101 and 2101 Introductory Physics  Areas of Research  Precision optics metrology Interferometry Fringe projection, moiré interferometry, structured light metrology Micro-optics and micro-structure characterization Non-contact inspection for manufacturing Optical testing  Resume and Publications Link Graduated Students Javaid Ikram  MS Opticla Science and Engineering, December 2009 Position after Graduation: Intel, Phoenix AZ Thesis:Terahertz Time of Flight Detection for Absolute Thickness Measurement of Single Side Polished Silicon Wafers  Daryl Purcell, PhD  PhD Optical Science and Engineering, May 2010 Position after Graduation: Tessera, Charlotte NC Dissertation:Interferometric Technique for Microstructure Metrology Using an Index Matching Liquid  Amit Suratkar, PhD  PhD Optical Science and Engineering, December 2009 Position after Graduation: Intel, Hillsboro OR Dissertation:Absolute Distance (Thickness) Metrology Using Wavelength Scanning Interferometry  Neil Gardner, PhD  PhD Mechanical Engineering, Spring 2007 Position after Graduation: ASML Optics Richmond, Richmond CA Dissertation:Precision Geometric Metrology of Refractive Micro-Lenses  Solomon Gugsa, PhD  PhD Optical Science and Engineering, Summer 2006 Position after Graduation: Hutchinson Technology Dissertation:New Analysis Strategies for Micro Aspheric Lens Metrology  Katherine Medicus, PhD  PhD Mechanical Engineering, Spring 2006 Position after Graduation: Mitutoyo Research Center Europe, the Netherlands Dissertation:Improving Measurements Based on the Cat’s Eye Retro-Reflection  Ayman Samara, PhD  PhD Optical Science and Engineering, Fall 2005 Position after Graduation: Intel Development Center, Hillsboro OR Dissertation:Enhanced Dynamic Range Fringe Projection for Micro-Structure Characterization  Daryl Purcell  MS Optical Science and Engineering, Fall 2005 Position after Graduation: PhD Program, Optical Science and Engineering, UNC Charlotte Thesis: Construction and Error Analysis of a Fringe Projection System  Brent Bergner  MS Optical Science and Engineering, Spring 2004 Position after Graduation: PhD Program, Optical Science and Engineering, UNC Charlotte Thesis:Self Calibration Technique for Transmitted Wavefront Measurements of Micro-Optics  Devendra Karodkar  MS Mechanical Engineering, Spring 2004 Position after Graduation: PhD Program, Mechanical Engineering, UNC Charlotte Thesis: Direct Traceable Radius of Curvature Measurement on Micro Interferometer  Neil Gardner  MS Mechanical Engineering, Fall 2003 Position after Graduation: PhD Program, Mechanical Engineering, UNC Charlotte Thesis: Self-Calibration for Micro-Refractive Lens Measurements  ", "academic_interests": ["", "", "", "aspheric lens", "fringe projection", "introductory physics", "materials physics", "micro lenses", "micro optics", "micro structure", "", "", "neil gardner", "optical testing", "physical optics", "precision optics", "silicon wafers", "structure characterization", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Physics and Optical Science"}, "Awad Gerges": {"link": "https://pages.charlotte.edu/connections/people/awad-gerges/", "bio": " Education Ph.D. Physics – University of Kent at Canterbury (1990) Specialty  Fiber-Optics Optical sensors Optical commnications Optical signal processing  ", "academic_interests": ["", "", "", "optical sensors", "optical signal processing", "", "", "specialty fiber optics", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Physics and Optical Science"}}, "Political Science and Public Administration": {"Amber Knight": {"link": "https://pages.charlotte.edu/connections/people/aknigh23/", "bio": "       ASSISTANT PROFESSOR              Amber Knight, Assistant Professor of Political Science and Public Administration, earned her B.A. from the University of California, Santa Cruz and her Ph.D. from the University of North Carolina, Chapel Hill. Her research generally focuses on contemporary democratic theory, disability theory, and feminist political thought. She has published articles inThe Journal of Politics,Hypatia, andPolitics, Groups, and Identities, among other outlets. She is currently working on a book project, tentatively titledDisability, Autonomy, and the Politics of Parenthood. The book examines the experiences of parents of children with disabilities in order to reconsider the meaning of autonomy and better understand the relationship between politics as usual” and the family. Chapters cover a range of relevant issues surrounding the experiences of parents of children with disabilities, including: reproductive autonomy and the selective abortion of disabled fetuses; guardianship laws; the ethic of care; and, special education policy.  Dr. Knight’s CV   Department Profile Page  ", "academic_interests": ["", "", "", "democratic theory", "disability theory", "", "", "feminist political thought", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Political Science and Public Administration"}, "Alexander Kustov": {"link": "https://pages.charlotte.edu/connections/people/akustov/", "bio": "Alexander Kustov is an Assistant Professor of Political Science and Political Administration at the University of North Carolina at Charlotte. His research focuses on public and policy responses to immigration and ethnic diversity in high-income countries. His work has been published in, among others, American Political Science Review,Comparative Political Studies,Journal of Ethnic and Migration Studies,Journal of Politics, andPolitical Psychology. Prior to his appointment at UNCC, Dr. Kustov was a Postdoctoral Associate in the Jackson Institute for Global Affairs at Yale University. He received his joint Ph.D. in Politics and Social Policy from Princeton University. You can find more information at https://alexanderkustov.org/.   ", "academic_interests": ["", "", "", "conflict", "immigration politics", "migration", "", "", "public goods", "public opinion", "race and ethnicity", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Political Science and Public Administration"}, "Beth Whitaker": {"link": "https://pages.charlotte.edu/connections/people/beth-whitaker/", "bio": "Beth Elise Whitaker is professor of political science and executive director of the Office of Interdisciplinary Studies at the University of North Carolina at Charlotte. Her research focuses on migration and security issues, especially in sub-Saharan Africa. She has done extensive work on African migration, exploring how political dynamics influence attitudes toward immigration, comparative refugee policy, and diaspora engagement in homeland politics. As a Fulbright Scholar in Kenya in 2005-2006, she conducted research on U.S.-African counter-terrorism cooperation. More recently, with a grant from the Minerva Initiative of the U.S. Department of Defense, Whitaker and colleagues launched the Resources and Conflict Project to examine how rebel groups’ illicit funding strategies influence conflict dynamics. Whitaker has conducted field research in Tanzania (1996-1998, 2003), Kenya (2005-2006, 2015, 2016), and Botswana (2005). Whitaker is co-author with John F. Clark of Africa’s International Relations: Balancing Domestic and Global Interests (Lynne Rienner Publishers, 2018) and her articles have appeared or are forthcoming in the Journal of Politics, Political Research Quarterly, African Affairs,Journal of Conflict Resolution, European Journal of International Relations, Journal of Peace Research, African Studies Review, Journal of Ethnic and Migration Studies, International Migration Review, Third World Quarterly, and Journal of Refugee Studies, among others. Whitaker is past chair of the African Politics Conference Group, a network of political scientists who study Africa, and was co-leader of the American Political Science Association (APSA) 2015 Africa Workshop on conflict and political violence. She worked previously at the Brookings Institution and the American Council on Education and has consulted for the U.S. Department of State, U.S. Department of Defense, Social Science Research Council, United Nations Foundation, and Save the Children Fund. She received her Ph.D. in 1999 from the University of North Carolina at Chapel Hill. ", "academic_interests": ["", "", "", "african politics", "conflict and security", "immigration politics", "", "", "international relations", "migration", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Political Science and Public Administration"}}, "Psychological Science": {"Alexia Galati": {"link": "https://pages.charlotte.edu/connections/people/agalati/", "bio": "         Assistant Professor        Dr. Galati’s Site Department Profile Page     Cognition & Learning   ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}, "Alyssa McGonagle": {"link": "https://pages.charlotte.edu/connections/people/amcgonag/", "bio": "         Assistant Professor        Dr. McGonagle’s Site Department Profile Page     Industrial/Organizational Psychology      I am an Assistant Professor of Psychology and Organizational Science. Myresearch focuses on worker health, safety, and well-being. I am currently working on research related to preventing disability discrimination at work, understanding factors that relate to workers’ perceptions of their work ability, and designing an intervention to promote work ability and quality of work life for workers with chronic health conditions. Please see mywebsitefor more information.      ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}, "Amy Canevello": {"link": "https://pages.charlotte.edu/connections/people/amy-canevello/", "bio": " Associate Professor Department of Psychological Science Health Psychology Ph.D. Program Organizational Science Ph.D. Program Education:  B.S.: North Dakota State University M.A.: University of Houston Ph.D.: University of Houston  Research Interests: Feeling at the mercy of a given situation or of other people can often leave people feeling powerless to making changes that can improve the quality of their lives. A simple but powerful assumption provides the foundation for my research: people create what they experience through the goals and beliefs that drive their behavior. As a social psychologist, I draw from the close relationships literature and use a combination of methodological approaches to explain the very basic, but often overlooked issue of how people’s intentions toward others affect their relationships and the consequences of these processes for the self and others. I examine these processes across various types of relationships, including in roommates, friends, coworkers, married and dating couples, and in interactions between strangers and acquaintances. My program of work shows that people’s goals or intentions toward others have powerful consequences for close relationships and personal well-being. When people have compassionate goals to support others, they and their relationships flourish: they give to others and others reciprocate, leading to better relationships and enhanced personal well-being for both people. People with self-image goals to manipulate others’ views of the self focus on meeting their own needs and view others as a means to get what they want or need. As a result, they and their relationships function poorly: they give less and others reciprocate, leading to poor relationship functioning and diminished personal well-being for both people (Canevello & Crocker, 2010; 2011; Crocker & Canevello, 2008; Crocker, Canevello, Breines, & Flynn, 2010; Mischkowski, Crocker, Niiya, Canevello, & Moeller, under review). More recently, I have begun to examine the ways in which interpersonal goals shape responses to adversity, including approaches interpersonal problems, forgiveness following relationship transgressions, and personal growth following traumatic events. Broadly, my research attempts to answer big questions, such as:  When and how do we create upward and downward spirals in our relationships with others? How do we contribute to what others experience? What does it mean to have good relationships and how can we create them? What are the benefits of giving vs. receiving?  If you are interested becoming a research assistant in Dr. Canevello’s lab: You should submit application materials the semester before you would like to join the lab. Applications for the Fall semester are accepted the previous spring; applications for the Spring semester are accepted the previous fall. Minimum requirements for these positions include: at least sophomore standing, a minimum 3.2 GPA (3.5 or higher is strongly preferred), previous research experience is a plus, and I rarely take people who have not completed the first research methods course (however, applications for outstanding students who do not meet one of these requirements may be considered). RAs work for research credit. I prefer that they take 3 hours, which translates to 12 hours per week in the lab, but I sometimes consider taking students for 2 credits (i.e., 9 hours per week). Generally, my team works between 9am and 5pm Monday through Friday (we sometimes extend those hours a bit). We don’t typically work evenings or weekends, though again, we sometimes have to make exceptions. Specific schedules will depend on the kinds of data that we collect – if we’re doing something with couples in the lab, it takes 2 RAs; running more simple procedures will only take one RA. But once we set a schedule, that will be the schedule. You would work the same hours every week and our weekly lab meeting would always be at the same time. Please email Dr. Canevello (acanevel@uncc.edu) or Kirby Magid (kmagid@uncc.edu) for an application. ", "academic_interests": ["", "", "", "benefits of giving", "creating good relationships", "", "", "relationships with others", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}, "Amy Peterman": {"link": "https://pages.charlotte.edu/connections/people/amy-peterman/", "bio": "  Education:  B.S., Carnegie Mellon University M.S., Ph.D., University of Pittsburg  Specific Research Interests:  Psychosocial oncology  Disease and treatment impact on personal goals and valued activities Spiritual well-being Adaptation to shortened life span (e.g., end of life issues)   Quality of life (HRQL) for people with chronic health conditions (e.g., cancer, multiple sclerosis)  Development and validation of HRQL measures – measuring what really matters to people Design and implementation of HRQL measures in cancer and neurology clinical trials      ", "academic_interests": ["", "", "", "chronic health conditions", "HRQL", "", "", "psychosocial oncology", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}, "Andrew Case": {"link": "https://pages.charlotte.edu/connections/people/andrew-case/", "bio": "My work focuses broadly on issues of racial equity. Through basic and applied research, I seek to: (a) identify the causes of racial disparities in health and life outcomes; and, (b) support community-driven strategies that reduce these disparities. One line of my current research is focused on examining community and societal risk factors (e.g., poverty and discrimination) that underlie the disproportionate disease burden experienced by African Americans in reference to cardiovascular disease. A second line of my research utilizes ethnographic and participatory research to address factors within organizations and communities that underlie racial disparities in health and life outcomes. Current investigations focus on empowerment as an anti-poverty strategy and empowering counterspaces as a means reducing juvenile offending and incarceration among racial minority youth. ", "academic_interests": ["", "", "", "counterspaces", "discrimination", "health outcomes", "life outcomes", "", "", "poverty", "racial disparities", "racial equality", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}, "Anita Blanchard": {"link": "https://pages.charlotte.edu/connections/people/anita-blanchard/", "bio": "Welcome to my web site! I am an associate professor of Psychological and Organization Science at UNC Charlotte. My research interests include people identify online and face-to-face groups and communities and the individual, group, and organizational outcomes of belonging to these groups and communities. I head up the Virtual Identity, Community, and Entitativity (V.I.C.E) Research Lab . We are composed of faculty, graduate students, and undergraduate students in organization Science, psychology, sociology and human-computer interactions. Indeed, we are the V.I.C.E squad!! Feel free to hang out on this site and leave a comment or two. I’m interested in seeing how this site can grow and evolve. If you are interested in my research lab, please go here. And finally, although I would LOVE to be best friends with our former FLOTUS Michelle Obama, I am not THAT Dr. Anita Blanchard. Thanks! ", "academic_interests": ["", "", "", "human-computer interactions", "virtual communities", "", "", "virtual work", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Psychological Science"}}, "Religious Studies": {"Alexandra Kaloyanides": {"link": "https://pages.charlotte.edu/connections/people/akaloyan/", "bio": "Alexandra Kaloyanides is an Assistant Professor in the Religious Studies department at the University of North Carolina, Charlotte where her teaching focuses on Buddhism. She researches Burmese religions and American religious history. Her book manuscript, Objects of Conversion, Relics of Resistance,” examines the religious contestations, conversions, and transformations during the nineteenth-century American Baptist mission to Burma. ", "academic_interests": ["", "", "", "American Baptists", "american religious history", "buddhism", "Burma", "", "", "Burmese religions", "religious contestations", "religious conversions", "religious transformation", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Religious Studies"}, "Barbara Thiede": {"link": "https://pages.charlotte.edu/connections/people/barbara-thiede/", "bio": "Ph.D., University of Missouri Judaic Studies; Liberal Studies I hold an M.A. and my PhD in History from the University of Missouri-Columbia and a second M.A. from UNC Charlotte’s Department of Religious Studies. I joined the department in 2006. I teach a range of courses on the texts of Hebrew Bible, Jewish history, the history of European antisemitism, and Jewish magic. My current research project is a study of the ways women’s bodies become the site for the expression of male friendships and homosocial relationships in biblical texts. I am currently working on a book for Routledge Press tentatively entitled Male Friendship, Homosociality, and Women in the Hebrew Bible: Malignant Fraternities.Upon finishing that book, I will move on to a mini-monograph (also for Routledge Press) currently titled Rape in the House of David: A Company of Men. My pronouns are she, her, and hers. My office is a Safe Zone.  Community Talks I head out into the community for presentations and talks on a regular basis. Topics range from Jewish practice and history to biblical texts (texts of terror, women in the Hebrew Bible, and the like). Teaching I love to teach. That’s the most important thing. Head for the tab Syllabi” above to see some of mine.  Most scholars agree that moose were not to be found in Ancient Israel. (Photo, Ralf Thiede)  Undergraduate Courses  RELS 2000 Religion and Magic RELS 2104 Hebrew Scriptures/Old Testament RELS 2110 Judaism RELS 3111 Women in Judaism RELS 3000 Women in the Hebrew Bible RELS 3000 God and Sex in Hebrew Bible RELS 3000 Why God Lies: The Difficult Deity of the Hebrew Bible RELS 3000 Where Abracadabra Comes From (Maybe): Magic in Judaism RELS 4000 Ketuvim: The Female Books” of the Hebrew Bible RELS 4000 Devilish Strange: The Figure of the Jew in Western Traditions RELS 4000 From Catastrophe to Cash: The Marketing of the Holocaust  Graduate Courses  RELS 5000 Ketuvim: The Female Books” of the Hebrew Bible RELS 5000 Turn the Other Cheek: The History of European Antisemitism RELS 5000 From Catastrophe to Cash: The Marketing of the Holocaust   An ancient gaming board currently residing in The Oriental Institute of Chicago. That the museum name includes the word oriental” should lead to discussion. Interested in finding out why? Check out what scholar Edward Said has to say at https://www.youtube.com/watch?v=fVC8EYd_Z_g (Photo by Ralf Thiede)  Research Interests They range. Biblical texts (and their historical contexts) fascinate me and I enjoy introducing students to their complex, multivalent nature. I have also spent many decades looking at the history of Jewish experience in Europe, focusing much of my attention on the way the Jew became a figure of mystery, threat, and outright danger for dominant cultures. ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Religious Studies"}}, "Sociology": {"Anne-Kathrin Kronberg": {"link": "https://pages.charlotte.edu/connections/people/akronber/", "bio": "  I am an Assistant Professor in Sociology and Organization Science at the University of North Carolina, Charlotte. Before coming to Charlotte, I completed my PhD at Emory University and worked as postdoctoral fellow at Goethe University Frankfurt, Germany. My research examines how organizations shape careers and career outcomes. These outcomes include income, promotions, external employer changes, and the decision to stay in a specific field. I am particularly interested in how careers differ by gender and race. In past and current projects, I have examined how firms’ policy, culture, and composition shape outcomes. For this purpose, I draw on a variety of research designs including longitudinal HR data of a single employer, publicly available linked employer-employee data on many organizations, and qualitative interviews with individual managers and employees. My research has been published in Social Forces, Work and Occupations, and Mobilization, and I received funding from the German Research Foundation (DFG). ", "academic_interests": ["", "", "", "careers", "complex organizations", "gender", "income inequality", "organizational sociology", "", "", "race", "social inequality", "social stratification", "work", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Sociology"}}, "Writing, Rhetoric, and Digital Studies": {"Amy Colombo": {"link": "https://pages.charlotte.edu/connections/people/acolomb2/", "bio": "       LECTURER | FIRST-YEAR WRITING     Department Profile Page   ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Writing, Rhetoric, and Digital Studies"}, "Aaron Kashtan": {"link": "https://pages.charlotte.edu/connections/people/akashtan/", "bio": "  LECTURER | FIRST-YEAR WRITING     Department Profile Page     ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Writing, Rhetoric, and Digital Studies"}, "Albert Wray": {"link": "https://pages.charlotte.edu/connections/people/albert-wray/", "bio": "Education Ph.D.Candidate (ABD), English, University of South Carolina, 2006-present. M.A. English, University of North Carolina at Charlotte, 2006. B.A. English, Appalachian State University, 1994. Recent Professional Appointments Full-time Lecturer, University Writings Program, First-Year Writing, University of North Carolina at Charlotte, 2012-present. Associate Member of the Graduate Faculty, University of North Carolina at Charlotte, 2001-2014. Research Interests: Digital Pedagogy, Composition, Early Modern British Drama. Civic Literature, Celebration, and Middle Class Identity in Early Modern British Drama Teaching Awards: William Richey Teaching Fellowship, University of South Carolina, 2010. William H. Nolte Graduate Teaching Assistant Award, University of South Carolina, 2008. Cile Moise First-Year English Award, University of South Carolina, 2008. Student nominated award for outstanding first-year English instructor. College of Arts and Sciences and Graduate School Award for Excellence in Teaching by a Graduate Teaching Assistant in a Social Sciences or Humanities Discipline, University of North Carolina at Charlotte, 2006. ", "academic_interests": ["", "", "", "celebration", "civic literature", "composition", "", "", "digital pedagogy", "early modern British drama", "middle class identity", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Writing, Rhetoric, and Digital Studies"}, "Angela Miss": {"link": "https://pages.charlotte.edu/connections/people/amiss/", "bio": "  I specialize in first-year writing, and I believe that it’s the most important class that students take in college! I’m interested in the connections and disconnections between classical rhetoric and digital technologies. I’m also interested in performance and performativity. I am looking forward creating a first-year writing class that combines my interest in digital literacy, multimodal projects, and performativity. I love Charlotte and enjoy its many great restaurants, craft brew pubs, and trivia nights. I am an avid record collector, and I also love the theater – whether I’m on stage or part of the audience. I have two children, Abby and Stephen Patrick, whose powerful rhetorical performances always keep me on my toes! I’m very excited about coming to UNCC to join such an energetic and exciting first-year writing program.   ", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Writing, Rhetoric, and Digital Studies"}, "Ashlyn Walden": {"link": "https://pages.charlotte.edu/connections/people/ashlyn-walden/", "bio": " Areas of Interest:  First Generation College Students Grammars and American English Dialects Rhetorical Reading Strategies Discourse Analysis & Literacy Studies  Selected Presentations: Re-Envisioning Grammar Instruction: A Method of Socio-Cultural Inquiry.” Conference: Reenvision, Recreation, Reformation. Virginia Tech. Blacksburg: February 2012. Divide the Power: Share the Benefits: Tutors and WRC Committee Work.” North Carolina Symposium on Teaching. North Carolina State University. Conference: A‘Non-Place’ to Visit: Exploring The Employment Practices And Working Conditions That Affect Writing nstructors. Raleigh: February 2012. Learnin’ Y’all Some Grammar: Metalinguistics and Grammar Instruction.” North Carolina English Teachers Association. Wake Forest University. Conference: Finding Common Ground. Winston-Salem: September 2011.  ", "academic_interests": ["", "", "", "American English dialects", "composition", "discourse analysis", "first generation college students", "first year writing", "", "", "grammars", "journal writing", "literacy studies", "personal writing", "rhetorical reading strategies", "", "", ""], "college": "College of Liberal Arts & Sciences", "department": "Writing, Rhetoric, and Digital Studies"}}}, "Lee College of Engineering": {"Civil and Environmental Engr": {}, "Electrical & Computer Engineering": {"Abasifreke Ebong": {"link": "https://pages.charlotte.edu/connections/people/aebong1/", "bio": "  Abasifreke (Aba) Ebong, Professor and Director of Graduate Program Department of Electrical and Computer Engineering, The University of North Carolina at Charlotte, 9201 University City Blvd, Charlotte, NC 28223-0001 Office: Grigg Hall 361 Phone: 704 687 0307 E-mail: aebong1@uncc.edu Education:  Ph.D. University of New South Wales, Australia, 1995 M.Sc. University of Port Harcourt, Nigeria, 1987 B.Sc. University of Port Harcourt, Nigeria, 1984 Six Sigma Green Belt, GE Global Research Center, NY, 2002  Research Interest  Design, modeling, fabrication, characterization, and analysis of solar cells including crystalline, thin films and organic solar cells Low-cost and high-efficiency solar cells (Silicon, III-V etc.) Characterization and understanding of solar cell materials-contacts and interfaces Surface passivation of electron devices III-V light emitting diodes for solid-state lighting   Current Research Low-cost contact to high-efficiency silicon solar cells ", "academic_interests": ["", "", "", "design", "device physics", "electrochemistry", "fabrication", "", "", "modeling", "opto-electronic devices", "solar cells", "surface passivation", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}, "Arindam Mukherjee": {"link": "https://pages.charlotte.edu/connections/people/amukherj/", "bio": "  Dr. Arindam Mukherjee Associate Professor             Department of Electrical and Computer Engineering University of North Carolina at Charlotte 9201 University City Blvd, Charlotte, NC 28223   Office: 235B Science and Technology Building Phone: 704- 687- 8417 Fax : 704- 687- 4762 Email:amukherj@uncc.edu  Research Interest: Computation in Smart Grids  Embedded Chip Multi-Processing (ECMP) Architecture Processor Simulation Micro-Architecture Exploration ECMP for Smart Grids Computing in Electric Power Systems Power Grid Simulation Multicore Implementation of SCADA and Smart Grid Algorithms Demand Side Management Cost, Load and Power Quality Optimizations  Curriculum Vita ", "academic_interests": ["", "", "", "algorithms", "cost optimizations", "demand side management", "embedded chip multi-processing architecture", "load optimizations", "micro-architecture exploration", "optimizations", "power grid", "", "", "power grid simulation", "power quality optimizations", "processor simulation", "scada algorithms", "smart grid algorithms", "smart grid computation", "smart grids", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}, "Asis Nasipuri": {"link": "https://pages.charlotte.edu/connections/people/anasipur/", "bio": "", "academic_interests": ["", "", "", "channel characterization", "communications", "communications channel coding", "communications modeling", "mobile ad hoc networks", "", "", "wireless CDMA", "wireless communications", "wireless mesh networks", "wireless sensor networks", "wireless sensor routing", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}, "Arun Ravindran": {"link": "https://pages.charlotte.edu/connections/people/aravindr/", "bio": "   Dr. Arun Ravindran Associate Professor  Department of Electrical and Computer Engineering University of North Carolina at Charlotte 9201 University City Blvd,Charlotte, NC 28223  Office: 2167 EPIC Phone: 704-687-8427 Fax: 704-687-5588 Email:(arun.ravindran)_at_(uncc)_dot_(edu)  Arun Ravindran is anAssociate Professor in the ECE department at the University of North Carolina at Charlotte. His current research interests are in the design and performance engineering of system software for cloud and edge computing systems. He teaches a two-semester graduate course on operating systems, and undergraduate courses in Data Structures and Algorithms, and C++. Ravindran has a Ph.D. in Electrical Engineering from the Ohio State University.   Advice for UNC Charlotte ECE Computer Engineering Graduate Students  ", "academic_interests": ["", "", "", "cloud computing", "dynamic performance optimization", "energy-efficient design", "", "", "feedback control", "machine learning", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}, "Andrew Willis": {"link": "https://pages.charlotte.edu/connections/people/arwillis/", "bio": "    Dr. Andrew R. Willis Assistant Professor     University of North Carolina – Charlotte Electrical and Computer Engineering Dept. 9201 University City Boulevard Charlotte, NC 28223-0001   Phone:   (704) 687-8420 Fax:      (704) 687-4762 Email:   arwillis@uncc.edu    Charlotte VisionLab    My interests lie in computer vision, pattern recognition, medical and natural image processing, and the general field of processing discrete geometries in multiple dimensions. Specific problems on which I currently work are the measurement and processing of 2D range images, 3D surface scans, and 4D data sets created by successive 3D surface scans over time. ", "academic_interests": ["", "", "", "3d scanning", "computer vision", "digital imagery", "", "", "digital signal processors", "embedded vision systems", "interdisciplinary collaboration", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}, "Badrul Chowdhury": {"link": "https://pages.charlotte.edu/connections/people/bchowdhu/", "bio": "", "academic_interests": ["", "", "", "distributed energy resource modeling", "electricity markets", "microgrid", "microgrid control", "microgrid optimization", "", "", "power system analysis", "power system control", "power system modeling", "renewable energy resource modeling", "smart grids", "", "", ""], "college": "Lee College of Engineering", "department": "Electrical & Computer Engineering"}}, "Engineering Tech & Constr Mgmt": {"Aidan Browne": {"link": "https://pages.charlotte.edu/connections/people/abrowne5/", "bio": " ", "academic_interests": ["", "", "", "applied energy systems", "control systems", "electro-mechanical systems", "engineering education", "medical devices", "", "", "medical diagnostics", "robotics", "sensors", "sensors conditioning", "signal conditioning", "", "", ""], "college": "Lee College of Engineering", "department": "Engineering Tech & Constr Mgmt"}, "Anthony Brizendine": {"link": "https://pages.charlotte.edu/connections/people/albrizen/", "bio": "    Abasifreke Ebong Ahmed El-Ghannam Aidan F. Browne, Ph.D. Andrew Willis Arindam Mukherjee Arun Ravindran Asis Nasipuri Babak Parkhideh Badrul Chowdhury Barry Sherlock Bienvenido Rodriguez-Medina Brett Tempest Brigid A Mullany Bruce Gehrig Charles Lee Cho Lab (Brain-on-a Chip Lab) Clint Halsted David C. Weggel David Whisler Deb Sharer Don Chen Dr. Churlzu Lim Ed Stokes Edward Morse, PhD Ertunga Ozelkan Farid Tranjan Glenda Mayo Gloria Elliott Harish Cherukuri Howie Fang In Hong Yang James Conrad James D. Bowen Jeff Kimble Jeff Raquet John Daniels John Hudak John Robert \"Mac\" McAlpine V Joshua Tarbutton Karen Thorsett-Hill, Ph.D. Kathryn L. Smith Kevin Lawton Kimberly Warren, Ph.D. Konstantinos Falaggis Linquan Bai Maciej Noras Mariya Munir Matthew Davies Matthew J. Whelan, Ph.D. Mei Sun Mesbah Uddin Milind V. Khire, Ph.D., P.E. Mohamed-Ali Hasan Naiquan (Nigel) Zheng Nan Byars Navid Goudarzi Nicole Braxtan Olya Keen Omidreza Shoghli Peter Tkacik Praveen Ramaprabhu Qiao-Chu \"Tony\" He Qiuming Wei Rajaram Janardhanam Ray Tsu Robert Cox Robert E. Johnson Russ Keanini Ryan Adams Scott Smith Sheng-Guo Wang Srinivas S. Pulugurtha Steve Patterson Stuart Smith Sukumar Kamalasadan, Ph.D. THinC Lab Tao Hong Tara Cavalline, PhD, PE Terence J. Fagan Tiefu Zhao Tom Weldon Tony Schmitz Valentina Cecchi Vincent Ogunro Wei (David) Fan Weimin Wang Welcome to the Xu Group Wesley Williams Yawo Amengonu Yesim Sireli Yong Zhang Youngjin Park Zhang Group    ", "academic_interests": ["", "", "", "continuous improvement", "earth structures", "educational pedagogy", "finite element analysis", "", "", "geotechnical engineering", "outcomes assessment", "probabilistic modeling", "risk analysis", "", "", ""], "college": "Lee College of Engineering", "department": "Engineering Tech & Constr Mgmt"}, "Ashley Spry": {"link": "https://pages.charlotte.edu/connections/people/amdavid1/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Lee College of Engineering", "department": "Engineering Tech & Constr Mgmt"}, "Alison Sears": {"link": "https://pages.charlotte.edu/connections/people/asears5/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Lee College of Engineering", "department": "Engineering Tech & Constr Mgmt"}}, "EPIC": {}, "Mech Engineering & Engineering Sci": {"Amirhossein Ghasemi": {"link": "https://pages.charlotte.edu/connections/people/aghasem1/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}, "Ahmed El-Ghannam": {"link": "https://pages.charlotte.edu/connections/people/arelgha/", "bio": "Dr. Ahmed El-Ghannam, PhD Associate Professor  Director of Orthopedic Tissue Engineering and Biomaterials Lab Dept. of Mechanical Engineering and Engineering Science The University of North Carolina at Charlotte Charlotte, NC 28223 Email: arelgha@uncc.edu Tel: 704-687-7730 Fax:704-687-8345 ", "academic_interests": ["", "", "", "bioactive ceramics", "bioactive fixation devices", "material-tissue integration", "orthopedic fixation devices", "", "", "orthopedic implants", "resorbable bioactive scaffolds", "stem cell preservation", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}, "Alexandra Stefanescu": {"link": "https://pages.charlotte.edu/connections/people/astefan1/", "bio": "", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}, "Alireza Tabarraei": {"link": "https://pages.charlotte.edu/connections/people/atabarra/", "bio": "Alireza Tabarraei, Ph.D. Associate Professor Department of Mechanical Engineering & Engineering Science The University of North Carolina at Charlotte Email: atabarra@uncc.edu Phone:+1 (704) 687-1087 Fax: +1 (704) 687-8345 Office: 388 Duke Centennial Hall  Other Academic Appointments:    Postdoctoral Fellow, Northwestern University, Evanston, IL    Educations    Ph.D., Structural Mechanics, the University of California at Davis, Thesis A Partition of Unity Finite Element Method on Polygonal and Quadtree Meshes”       MS.C., Structural Mechanics, Sharif University of Technology, Thesis H-Adaptive Mesh Refinement for Shear Band Localization in Elasto-Plasticity Cosserat Continuum”       BS.C., Civil Engineering, Sharif University of Technology        ", "academic_interests": ["", "", "", "composite material multiscale modeling", "composite materials failure mechanics", "computational solid mechanics", "", "", "dynamic load materials mechanics", "nano material multiscale modeling", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}, "Artur Wolek": {"link": "https://pages.charlotte.edu/connections/people/awolek/", "bio": "Artur Wolek is an Assistant Professor in the Mechanical Engineering and Engineering Science Department at The University of North Carolina at Charlotte. Previously, he was a Postdoctoral Fellow with the Collective Dynamics and Control Laboratory at the University of Maryland (2018-2020) and with the Acoustics Division at the U.S. Naval Research Laboratory (2015-2018). He taught undergraduate and graduate courses in robotics as an Adjunct Lecturer in the Electrical Engineering and Computer Science Department at Catholic University (2017-2018). Wolek received the B.S. and Ph.D. degrees in Aerospace Engineering from Virginia Tech in 2010 and 2015, respectively, while working in the Nonlinear Systems Laboratory. His research interests are in the area of adaptive sampling with mobile sensor networks, robot path planning and decision-making, and marine and aerial robotics. His research emphasizes validation of fundamental research results through field experiments. ", "academic_interests": ["", "", "", "aerospace", "autonomy", "control systems", "data fusion", "mobile sensor networks", "", "", "multi-robot systems", "ocean engineering", "optimization", "robotics", "vehicle dynamics", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}, "Brigid Mullany": {"link": "https://pages.charlotte.edu/connections/people/bamullan/", "bio": " Brigid A Mullany, PhD. Professor bamullan@uncc.edu Duke Centennial Hall, Room 231 Phone: 704-687-8343 Fax: 704-687-8345    Currently I am working at the National Science Foundation in the Civil, Mechanical and Manufacturing Innovation (CMMI) division of the Engineering Directorate. I am still maintaining my UNCC research activities.    Education  Both my undergraduate and graduate degrees are from University College Dublin (UCD), Ireland.  Bachelors Degree in Mechanical Engineering, July 1995    Doctorate (Ph.D.) in Mechanical Engineering, January 2002.   My Ph.D. was on the chemical mechanical polishing (CMP) of silicon oxide coated wafers. This project was funded by Intel, Ireland. The research involved looking at CMP process fundamentals such as temperature distributions, pressure distributions and pad wear. As part of my Ph.D. I was lucky enough to spend a year conducting experiments in both UC Berkeley, CA, and the National Institute of Standards and Technology (NIST), MD.  Previous Ventures  After graduating with my engineering degree (1995) I worked for over a year with BOSE, Ireland (the loudspeaker people). There I supported production and was involved in new project introduction. After a year and a bit I went back to College to get my Ph.D. (see above). On completion of my Ph.D. I got an EU funded Marie Curie Fellowship position at Carl Zeiss in Oberckocken, Germany. Carl Zeiss make optical components for everything. I was there from March 2002 to March 2004. During that time I learned about traditional polishing, advanced finishing techniques, production considerations, metrology and most importantly how to speak German (sort of ish).  Present Day  I joined UNC Charlotte in August 2004 and am a tenured Professor within the Department of Mechanical Engineering. The links on the top of this page will tell you what I teach, my research areas, where I get my funding from and the students that work with me to make it all happen. ", "academic_interests": ["", "", "", "flexible polishing platforms", "laser crystals subsurface damage", "polishing systems", "polishing systems vibrational analysis", "", "", "polishing tool materials dynamic analysis", "robust form measurement", "vibrational finishing of metals", "vortex polishing", "", "", ""], "college": "Lee College of Engineering", "department": "Mech Engineering & Engineering Sci"}}, "Student Dev & Success": {}, "Systems Engin & Engin Management": {}}, "School of Data Science (SDS)": {}}]