[{"name": "Albert Wray", "department": "Writing, Rhetoric, and Digital Studies", "academic_interests": ["", "", "", "celebration", "civic literature", "composition", "", "", "digital pedagogy", "early modern British drama", "middle class identity", "", "", ""], "college": "College of Liberal Arts & Sciences", "bio": "Education Ph.D.Candidate (ABD), English, University of South Carolina, 2006-present. M.A. English, University of North Carolina at Charlotte, 2006. B.A. English, Appalachian State University, 1994. Recent Professional Appointments Full-time Lecturer, University Writings Program, First-Year Writing, University of North Carolina at Charlotte, 2012-present. Associate Member of the Graduate Faculty, University of North Carolina at Charlotte, 2001-2014. Research Interests: Digital Pedagogy, Composition, Early Modern British Drama. Civic Literature, Celebration, and Middle Class Identity in Early Modern British Drama Teaching Awards: William Richey Teaching Fellowship, University of South Carolina, 2010. William H. Nolte Graduate Teaching Assistant Award, University of South Carolina, 2008. Cile Moise First-Year English Award, University of South Carolina, 2008. Student nominated award for outstanding first-year English instructor. College of Arts and Sciences and Graduate School Award for Excellence in Teaching by a Graduate Teaching Assistant in a Social Sciences or Humanities Discipline, University of North Carolina at Charlotte, 2006. ", "link": "https://pages.charlotte.edu/connections/people/albert-wray/"}, {"name": "Anthony Brizendine", "department": "Engineering Tech & Constr Mgmt", "academic_interests": ["", "", "", "continuous improvement", "earth structures", "educational pedagogy", "finite element analysis", "", "", "geotechnical engineering", "outcomes assessment", "probabilistic modeling", "risk analysis", "", "", ""], "college": "Lee College of Engineering", "bio": "    Abasifreke Ebong Ahmed El-Ghannam Aidan F. Browne, Ph.D. Andrew Willis Arindam Mukherjee Arun Ravindran Asis Nasipuri Babak Parkhideh Badrul Chowdhury Barry Sherlock Bienvenido Rodriguez-Medina Brett Tempest Brigid A Mullany Bruce Gehrig Charles Lee Cho Lab (Brain-on-a Chip Lab) Clint Halsted David C. Weggel David Whisler Deb Sharer Don Chen Dr. Churlzu Lim Ed Stokes Edward Morse, PhD Ertunga Ozelkan Farid Tranjan Glenda Mayo Gloria Elliott Harish Cherukuri Howie Fang In Hong Yang James Conrad James D. Bowen Jeff Kimble Jeff Raquet John Daniels John Hudak John Robert \"Mac\" McAlpine V Joshua Tarbutton Karen Thorsett-Hill, Ph.D. Kathryn L. Smith Kevin Lawton Kimberly Warren, Ph.D. Konstantinos Falaggis Linquan Bai Maciej Noras Mariya Munir Matthew Davies Matthew J. Whelan, Ph.D. Mei Sun Mesbah Uddin Milind V. Khire, Ph.D., P.E. Mohamed-Ali Hasan Naiquan (Nigel) Zheng Nan Byars Navid Goudarzi Nicole Braxtan Olya Keen Omidreza Shoghli Peter Tkacik Praveen Ramaprabhu Qiao-Chu \"Tony\" He Qiuming Wei Rajaram Janardhanam Ray Tsu Robert Cox Robert E. Johnson Russ Keanini Ryan Adams Scott Smith Sheng-Guo Wang Srinivas S. Pulugurtha Steve Patterson Stuart Smith Sukumar Kamalasadan, Ph.D. THinC Lab Tao Hong Tara Cavalline, PhD, PE Terence J. Fagan Tiefu Zhao Tom Weldon Tony Schmitz Valentina Cecchi Vincent Ogunro Wei (David) Fan Weimin Wang Welcome to the Xu Group Wesley Williams Yawo Amengonu Yesim Sireli Yong Zhang Youngjin Park Zhang Group    ", "link": "https://pages.charlotte.edu/connections/people/albrizen/"}, {"name": "Andrew Leventis", "department": "Art & Art History", "academic_interests": ["", "", "", "art", "art history", "cultural studies", "fine arts", "mass media", "", "", "oil painting", "painting", "popular culture", "visual arts", "", "", ""], "college": "College of Arts & Architecture", "bio": "       Andrew Leventis is an Assistant Professor of Painting in the Department of Art & Art History. Heis an oil painter who references imagery from film and television in his work. He earned a BFA in Painting from the American Academy of Art in Chicago and an MFA in Fine Art from Goldsmiths College, University of London. Over the past years, his work has been featured in Norway at Kunstgalleriet, in London at Matt Roberts Arts, and in Rome at The Venanzo Crocetti Museum. In the US, his work was recently incorporated into the Mainframeexhibition at the Mint Museum of Art, and at The Brooklyn Waterfront Artists’ Coalition annual juried show. See his faculty profile at coaa.uncc.edu >>   ", "link": "https://pages.charlotte.edu/connections/people/aleventi/"}, {"name": "Allison Hahn", "department": "Mathematics and Statistics", "academic_interests": ["", "", "", "", "", "", "", ""], "college": "College of Liberal Arts & Sciences", "bio": "  LECTURER     Department Profile Page     ", "link": "https://pages.charlotte.edu/connections/people/allison-hahn/"}, {"name": "Allison Stedman", "department": "Languages and Culture Studies", "academic_interests": ["", "", "", "comparative literature", "experimental literature", "", "", "fairy tales", "french literature", "", "", ""], "college": "College of Liberal Arts & Sciences", "bio": "Education  Ph.D., University of Pennsylvania, 2002 (French Literature) M.A., University of Pennsylvania, 1999 (French Literature) A.M., Dartmouth College, 1997 (Comparative Literature; French, Italian, Spanish) A.B., magna cum laude, Dartmouth College, 1996 (Comparative Literature; French, Italian)   Profile As a literary historian specializing in French cultural history, my goal is to help students learn to read texts on multiple levels, analyzing not only their content, but also their form and style. My classes are designed to encourage students to look beyond what a text communicates overtly in the plot, focusing instead on how ideas are embedded and repeated as narrative patterns that are generally unconsciously produced by the author. Unearthing an author’s implicit cultural biases enables us to learn more about the ways in which people related to the world around them during the time period in which the text was created. Before arriving at UNC-Charlotte, I taught at Bucknell University from 2002-2007.  Links  Bucknell University Press Profile Social Media had precedent in 17th century (Charlotte Observer article) French Major Eileen Jakeway Wins First Prize at the Charlotte Research Scholars Symposium CLAS Professor Receives Prestigious NEH Fellowship NEH Public Query Form   Research and Teaching Interests  Early Modern / early Enlightenment French literature Literature’s role in creating Enlightenment Culture Experimental literature, particularly generic hybrids Intersections between literature, music and the fine arts in France and Italy Relationships between mental processes and physical symptoms during the early modern period Early Modern French Pilgrimage Practices   Books In Progress The Mind-Body Connection in Early-Modern France, 1580-1715: Metaphysics, Mysticism, Miracles, Medicine Project funded by an NEH faculty fellowship (spring-fall 2017) and by a Franklin Grant from the American Philosophical Society (summer 2013).   In Print        Rococo Fiction in France, 1600-1715: Seditious Frivolity. Lewisburg, PA: Bucknell UP, hardcover 2013. Winner Outstanding Academic Title 2013” by Choice Book Awards. / Reprinted in paperback, 2014. https://rowman.com/ISBN/9781611484373/Rococo-Fiction-in-France-1600—1715-Seditious-Frivolity  Henriette-Julie de Castelnau comtesse de Murat. Voyage de campagne. Critical Edition by Allison Stedman. Rennes: Presses Universitaires de Rennes, 2014. http://www.pur-editions.fr/detail.php?idOuv=3368  A Trip to the Country: by Henriette-Julie de Castelnau, Comtesse de Murat. Intro. Allison Stedman, Ed. and Trans. Perry Gethner and Allison Stedman. Detroit MI: Wayne State University Press, 2011. http://www.wsupress.wayne.edu/books/detail/trip-country   Selected Articles and Book Chapters  Secret History in Pre-Revolutionary France.” In Secret History in the Long Eighteenth Century. Ed. Rachel Carnell and Rebecca Bullard (Cambridge, UK: Cambridge University Press, 2017) 205-15. Lafayette Rewrites History, Murat Rewrites Lafayette: the Novel and the Transfiguration of the Social Sphere in Old-Regime France.” Cahiers du dix-septième: An Interdisciplinary Journal XIV (2012) 1-21.  ‘The Savage’ by Henriette-Julie de Castelnau, comtesse de Murat,” trans. Allison Stedman, in Marvelous Transformations: An Anthology of Tales and New Critical Perspectives, Ed. Christine Jones and Jennifer Shacker (Ontario: Broadview, 2012) 201-218. Jean Racine, Marie-Jeanne Lhéritier de Villandon, and Charles Perrault: A Revised Triumvirate,” in Options for Teaching 17th and 18th-Century French Women Writers. (New York: Modern Languages Association of America, 2011) 101-108. Prolepic Subversion: Longing for the Middle Ages in the Fin-de-siècle French Fairy Tale.” The Romanic Review 99:2 (2008) 369-386. Teaching the Interdisciplinary Seventeenth-Century to Undergraduates: A Literary Historian’s Perspective,” Cahiers du dix-septième: An Interdisciplinary Journal XI: 1 (2006) 103-122.  D’Aulnoy’s Histoire d’Hypolite, comte de Duglas (1690): a Fairy-Tale Manifesto,” Marvels & Tales: Journal of Fairy-Tale Studies 19:1 (2005) 32-53.  ", "link": "https://pages.charlotte.edu/connections/people/allison-stedman/"}]